Repository: Waqasritman/TotiWalletIos
Catalog: Toti Wallet/StoryBoard/*.lproj/Localizable.strings
Languages: ar

# privacy_txt
source: Welcome to the Totipay Ltd website (hereinafter referred to as TOTIPAY) www.totipay.com. Protecting your privacy is very important to us. Therefore the purpose of this Policy is to inform our customers and other individuals (you or your) how we deal with, collect, use, disclose and protect your personal information. This Policy applies to our collection of, use of and disclosure of, personal information in the United Kingdom. This Policy does not apply to information about our employees or to information that is not personal information. You can be assured that TOTIPAYalwaystake steps to comply with the privacy principles and requirements under applicable UK privacy legislation. This policy is applicable to all TOTIPAY consumers and visitors who visit our website. www.totipay.com Personal Information The personal information that we collect is information about an identifiable individual, as described under applicable privacy legislation. TOTIPAY collects personal information about you from a variety of sources in the course of providing you with money transfer service and other related products and services, which include the following: We collect personal information when you ask us to send money or to provide other any other Service to you. This personal information may include identities and contact information of senders and recipients of money transfers or payments, credit card, banking or other billing information, birth dates and other personal identifiers such as Passport details, Driving License or other such governmental identification. Information is used to verify your identity for security and fraud prevention purposes, identification numbers and amounts paid, transferred, exchanged or otherwise processed. We collect information about your transactions with us, including transaction history, such as frequency of use and amounts paid, transferred, exchanged or otherwise processed and any rewards program account information, if any. verification, fraud prevention In and similar security purposes, we collect and/or confirm certain identity-related information, financial background and similar information through third parties sources such as government agencies and consumer reporting agencies. We may collect personal information otherwise with your consent or as permitted or required by law.connectionwithidentify Use of Personal Information We generally use personal information for the purposes of providing you the Service. This may include the following purposes: Authorising and processing your transactions, including effecting and administering money transfers, and ensuring proper payment to the designated recipient of funds. Collecting amounts owing to us, and otherwise enforcing and collecting on your accounts or agreements with us. Meeting legal, regulatory, self-regulatory, risk management, fraud prevention and security requirements, which may include (among other measures) verifying the identity of the customer and receiver of funds and checking identities against money laundering, terrorist financing or similar watch lists established by regulatory agencies or similar bodies in the UK or in other countries. For identity verification purposes, customers and receiver of money transfers may be required to produce valid identification or consent to verification by other means. Maintaining business and transaction records for reasonable periods, and generally managing and administering our business. Meeting insurance, audit and processing requirements. Otherwise, as permitted or required by law. There may be circumstances in which TOTIPAY is obliged to collect, use, or disclose certain personal information without your consent. Such circumstances include: A serious and imminent threat to someone’s life, health or safety. A serious threat to public health or public safety. Unlawful activity has been, is being or may be engaged in. If TOTIPAY reasonably believes that the use or disclosure is necessary for the prevention, detection , investigation, prosecution or punishment of: Criminal offences, breach of law, imposing of penalty or sanction or breach of a prescribed law. the enforcement of laws relating to the confiscation of the proceeds of crime. the protection of the public revenue; the prevention, detection, investigation or remedying of seriously improper conduct or prescribed conduct; or the preparation for, or conduct of, proceedings before any Court or Tribunal, or implementation of the orders of a Court or Tribunal. If TOTIPAY is obliged to use or disclose your personal information as herein mentioned, it will create a written report of the use or disclosure. We store information that we collect through cookies, log files, and/or third parties to create a profile of our users. Consequently, collected information is used to improve the content of the site for the user. If we make changes to any of our Privacy Policies or practices with respect to how we use personally identifiable information, we will post those changes with or without notice to this Privacy Policy as and when they come into effect. In some cases we may be required to disclose certain information to comply with a legal process, such as a court order, subpoena or search warrant. Disclosure of Your Personal Information We may disclose your personal information to our affiliate partners and to unaffiliated third parties in connection with the purposes described in this Privacy Policy as follows: To Provide Services: In order to process and complete the requested Service, we may disclose personal information to the recipient of a money transfer, to our agents or affiliates, and, if applicable, the recipient and any intermediary banks or other financial institutions or financial services companies involved in the transaction or our Service. Service Providers: We may transfer personal information to outside agents or service providers (including our affiliate partners acting in this capacity) that perform services on our behalf, for example, information technology and/or data hosting or processing services. Some of these service providers or affiliate partners may be located outside the United Kingdom, and your personal information may be collected, used, disclosed, stored and processed in the United Kingdom or elsewhere for the purposes described in this Privacy Policy. We take reasonable measures to ensure that personal information that may be processed by these service providers on our behalf is protected and not used or disclosed for purposes other than as directed by us, subject to legal requirements in the UK and other foreign countries applicable to our affiliates, agents and service providers, for example lawful requirements to disclose personal information to government authorities in those countries. Business Transactions: Your personal information may be used by us and disclosed to parties connected with the contemplated or actual financing, securitisation, insuring, sale, assignment or other disposal of all or part of our business or assets (including, for example, your account with us), for purposes related to the evaluation and performance of these transactions, including: permitting such parties to evaluate and determine whether to proceed or continue with the transaction, and fulfilling reporting, inspection or audit requirements or obligations to such parties. Our successors and assignees and/or its business or assets may use and disclose your personal information for similar purposes as described in this Privacy Policy. Legal, Regulatory, etc: TOTIPAY may disclose your personal information as necessary to meet legal, regulatory, self-regulatory, insurance, audit, and security requirements, and as otherwise with your consent or as permitted or required by law (including as required by applicable UK and foreign laws). UK Financial Conduct Authority (FCA) require all financial institutions including TOTIPAY to verify but not limited to the identity of the customer, purpose of transaction and source of funds. To comply with these regulatory requirements, we will be comparing, which also include sharing the information that you have provided such as but not limited to Name, Address, Driver's license number and any other information contained in your consumer report, with available and reputable ID verification service provider. Such agency will only use the information in your consumer report for the purpose of validating your identity and no other. If we are unable to validate your identity through the on-line process, you will be directed to an alternative, off-line process. Additional documentary proof might be required for establishing the source of funds. Our services have also been regulated by the HMRC and comply with money laundering regulations. Your Consent Consent to the collection,useand disclosure of personal information may be given in various ways. Consent can be express (for example, orally, electronically or on a form you may sign describing the intended uses and disclosures of personal information) or implied (for example, when you provide information necessary for a service you have requested). You may provide your consent in some circumstances where notice has been provided to you about our intentions with respect to your personal information and you have not withdrawn your consent for an identified purpose, such as by using an opt out option provided, if any. Consent may be given by your authorized representative (such as a legal guardian or a person having a power of attorney). Generally, by providing us with personal information, we will assume that you consent to our collection, use and disclosure of such information for the purposes identified or described in this Privacy Policy, if applicable, or otherwise at the time of collection. You may withdraw your consent to our collection, use and disclosure of personal information at any time, subject to contractual and legal restrictions and reasonable notice. Note that if you withdraw your consent to uses of your personal information, we may no longer be able to provide certain Services. Note also that where we have provided or are providing services to you, your consent will be valid for so long as necessary to fulfill the purposes described in this Privacy Policy or otherwise at the time of collection, and you may not be permitted to withdraw consent to certain necessary uses and disclosures (for example, but not limited to, maintaining reasonable business and transaction records and disclosures to UK and foreign government entities as required to comply with laws). TOTIPAY collects, uses and discloses your personal information with your consent, except as permitted or required by law. We may be required or permitted under state laws, federal laws, or foreign statute or regulation to collect, use or disclose personal information without your consent, for example to comply with a court order, to comply with local or federal regulations or a legally permitted inquiry by a government agency, or to collect a debt owed to us. Security TOTIPAY takes all reasonable steps to protect your personal information using physical, electronic or procedural security measures appropriate to the sensitivity of the information in our custody or control, which may include safeguards to protect against loss or theft, as well as unauthorised access, disclosure, copying, use or modification. Our authorised employees, agents and subsidiaries who require access to your personal information in order to fulfill their job requirements will have access to your personal information. We have in place a range of security safeguards to protect your personal information against loss or theft, as well as unauthorized access, disclosure, copying, use, or modification, regardless of the format in which it is held. TOTIPAY work to protect personally identifiable information stored on their site’s server from unauthorised access using commercially available and industrially acceptable standards of computer security products, such as firewalls, as well as carefully developed security procedures and practices. In addition, a username and password are generally required for you to use, view or change application or interview information. We use both internal and external resources to review the adequacy of security measures on a regular basis. TOTIPAY ensures that all staff are aware of the importance of maintaining the confidentiality of personal information. Access, Correction and Contacting Us TOTIPAY will upon request allow you to access to your personal information. The requested information shall be provided or made available in a form that is generally understandable. In circumstances where you point out to us that any information held by us is inaccurate or incomplete, we will take appropriate action to amend the information as required and, if necessary, notify any third party of the correction. There may be circumstances which preclude TOTIPAY from providing access to some or all of your personal information. Those circumstances could be: The information may contain references to other individuals; Legal, investigative, security, or commercial proprietary reasons; or The information is subject to solicitor/client or litigation privilege. This Privacy Policy Though we make every effort to preserve user privacy, we may need to disclose personal information when required by law wherein we have a good-faith belief that such action is necessary to comply with a current judicial proceeding, a court order or legal process served on our websites. Legal Disclaimer This Privacy Policy may be revised from time to time. If we intend to use or disclose Personal Information for purposes materially different than those described in this Policy, we will make reasonable efforts to notify affected individuals, if necessary, including by revising this Privacy Policy. If you are concerned about how your personal information is used, you should contact us as described above to obtain a current copy of this Privacy Policy. We urge you to request and review this Privacy Policy frequently to obtain the current version. Your continued provision of personal information or use of our services following any changes to this Privacy Policy constitutes your acceptance of any such changes. Privacy Policy Changes or telephone us at +44 - 7508084715. If you wish to make inquiries or complaints or have other concerns about our personal information practices, you may write to us as described above, e-mail us at lastmodified April 25, 2018.info@totipay.com
ar: مرحبًا بكم في موقع Totipay Ltd الإلكتروني (المشار إليه فيما يلي باسم TOTIPAY) www.totipay.com. حماية خصوصيتك أمر في غاية الأهمية بالنسبة لنا. لذلك ، فإن الغرض من هذه السياسة هو إبلاغ عملائنا والأفراد الآخرين (أنت أو أنت) بكيفية تعاملنا مع معلوماتك الشخصية وجمعها واستخدامها والكشف عنها وحمايتها. تنطبق هذه السياسة على جمع المعلومات الشخصية واستخدامها والإفصاح عنها في المملكة المتحدة. لا تنطبق هذه السياسة على المعلومات المتعلقة بموظفينا أو على المعلومات التي ليست معلومات شخصية. يمكنك التأكد من أن TOTIPAY تتخذ خطوات للامتثال لمبادئ ومتطلبات الخصوصية بموجب تشريعات الخصوصية المعمول بها في المملكة المتحدة. تنطبق هذه السياسة على جميع مستهلكي وزوار TOTIPAY الذين يزورون موقعنا على الويب. www.totipay.com المعلومات الشخصية المعلومات الشخصية التي نجمعها هي معلومات حول فرد يمكن التعرف عليه ، كما هو موضح في تشريع الخصوصية المعمول به. تجمع TOTIPAY معلومات شخصية عنك من مجموعة متنوعة من المصادر في سياق تزويدك بخدمة تحويل الأموال والمنتجات والخدمات الأخرى ذات الصلة ، والتي تشمل ما يلي: نقوم بجمع المعلومات الشخصية عندما تطلب منا إرسال أموال أو تقديم أي خدمة أخرى لك. قد تتضمن هذه المعلومات الشخصية الهويات ومعلومات الاتصال الخاصة بالمرسلين والمستفيدين من التحويلات المالية أو المدفوعات أو بطاقات الائتمان أو المعلومات المصرفية أو معلومات الفوترة الأخرى وتواريخ الميلاد والمعرفات الشخصية الأخرى مثل تفاصيل جواز السفر أو رخصة القيادة أو أي تعريف حكومي آخر. تُستخدم المعلومات للتحقق من هويتك لأغراض الأمان ومنع الاحتيال ، وأرقام التعريف والمبالغ المدفوعة أو المحولة أو المتبادلة أو المعالجة بأي طريقة أخرى. نقوم بجمع معلومات حول معاملاتك معنا ، بما في ذلك سجل المعاملات ، مثل تكرار الاستخدام والمبالغ المدفوعة أو المحولة أو المتبادلة أو المعالجة بأي طريقة أخرى وأي معلومات عن حساب برنامج المكافآت ، إن وجدت. التحقق ومنع الاحتيال لأغراض أمنية مماثلة ، نقوم بجمع و / أو تأكيد بعض المعلومات المتعلقة بالهوية والخلفية المالية والمعلومات المماثلة من خلال مصادر أطراف ثالثة مثل الوكالات الحكومية ووكالات الإبلاغ عن المستهلكين. يجوز لنا جمع المعلومات الشخصية بخلاف ذلك بموافقتك أو وفقًا لما يسمح به القانون أو يقتضيه استخدام المعلومات الشخصية بشكل عام ، نستخدم المعلومات الشخصية لأغراض توفير الخدمة لك. قد يشمل ذلك الأغراض التالية: التفويض بمعاملاتك ومعالجتها ، بما في ذلك إجراء وإدارة تحويلات الأموال ، وضمان الدفع المناسب للمستلم المعين للأموال. تحصيل المبالغ المستحقة لنا ، وفرض وتحصيل حساباتك أو اتفاقياتك معنا. تلبية المتطلبات القانونية والتنظيمية والتنظيمية الذاتية وإدارة المخاطر ومنع الاحتيال والأمن ، والتي قد تشمل (من بين تدابير أخرى) التحقق من هوية العميل ومتلقي الأموال والتحقق من الهويات ضد غسل الأموال وتمويل الإرهاب أو إنشاء قوائم مراقبة مماثلة من قبل الوكالات التنظيمية أو الهيئات المماثلة في المملكة المتحدة أو في دول أخرى. لأغراض التحقق من الهوية ، قد يُطلب من العملاء ومتلقي التحويلات المالية إبراز هوية صالحة أو الموافقة على التحقق بوسائل أخرى. الاحتفاظ بسجلات الأعمال والمعاملات لفترات معقولة ، وإدارة أعمالنا وإدارتها بشكل عام. تلبية متطلبات التأمين والتدقيق والمعالجة. بخلاف ذلك ، وفقًا لما يسمح به القانون أو يقتضيه. قد تكون هناك ظروف تكون فيها TOTIPAY ملزمة بجمع معلومات شخصية معينة أو استخدامها أو الكشف عنها دون موافقتك. مثل هذه الظروف تشمل: تهديد خطير ووشيك على حياة شخص ما أو صحته أو سلامته. تهديد خطير للصحة العامة أو السلامة العامة. نشاط غير قانوني قد تم أو يجري أو قد يكون متورطًا فيه. إذا اعتقدت TOTIPAY بشكل معقول أن الاستخدام أو الإفصاح ضروري للوقاية أو الكشف أو التحقيق أو المقاضاة أو العقوبة فيما يتعلق بما يلي: الجرائم الجنائية أو خرق القانون أو فرض عقوبة أو عقوبة أو مخالفة قانون محدد. إنفاذ القوانين المتعلقة بمصادرة عائدات الجريمة. حماية الإيرادات العامة ؛ منع السلوك غير اللائق أو السلوك الموصوف أو كشفه أو التحقيق فيه أو تداركه ؛ أو التحضير أو سير الإجراءات أمام أي محكمة أو محكمة ، أو تنفيذ أوامر محكمة أو محكمة. إذا كانت TOTIPAY ملزمة باستخدام أو الكشف عن معلوماتك الشخصية كما هو مذكور هنا ، فسوف تقوم بإنشاء تقرير مكتوب عن الاستخدام أو الكشف. نقوم بتخزين المعلومات التي نجمعها من خلال ملفات تعريف الارتباط و / أو ملفات السجل و / أو الجهات الخارجية لإنشاء ملف تعريف لمستخدمينا. وبالتالي ، يتم استخدام المعلومات التي تم جمعها لتحسين محتوى الموقع للمستخدم. إذا قمنا بإجراء تغييرات على أي من سياسات الخصوصية أو الممارسات الخاصة بنا فيما يتعلق بكيفية استخدامنا لمعلومات التعريف الشخصية ، فسنقوم بنشر هذه التغييرات مع أو بدون إشعار لسياسة الخصوصية هذه عندما تدخل حيز التنفيذ. في بعض الحالات ، قد يُطلب منا الكشف عن معلومات معينة للامتثال لإجراءات قانونية ، مثل أمر محكمة أو أمر استدعاء أو أمر تفتيش. إفشاء معلوماتك الشخصية قد نكشف عن معلوماتك الشخصية لشركائنا التابعين والأطراف الثالثة غير المنتسبة فيما يتعلق بالأغراض الموضحة في سياسة الخصوصية هذه على النحو التالي: لتقديم الخدمات: من أجل معالجة الخدمة المطلوبة وإكمالها ، يجوز لنا الكشف عن المعلومات الشخصية لمتلقي تحويل الأموال ، إلى وكلائنا أو الشركات التابعة لنا ، وإذا أمكن ، المستلم وأي بنوك وسيطة أو مؤسسات مالية أو مالية أخرى شركات الخدمات المشاركة في المعاملة أو خدمتنا. مقدمو الخدمات: يجوز لنا نقل المعلومات الشخصية إلى وكلاء أو مزودي خدمة خارجيين (بما في ذلك شركائنا التابعين الذين يعملون بهذه الصفة) الذين يؤدون خدمات نيابة عنا ، على سبيل المثال ، تكنولوجيا المعلومات و / أو خدمات استضافة البيانات أو معالجتها. قد يكون بعض مزودي الخدمة أو الشركاء التابعين موجودين خارج المملكة المتحدة ، وقد يتم جمع معلوماتك الشخصية واستخدامها والإفصاح عنها وتخزينها ومعالجتها في المملكة المتحدة أو في أي مكان آخر للأغراض الموضحة في سياسة الخصوصية هذه. نحن نتخذ تدابير معقولة لضمان حماية المعلومات الشخصية التي قد تتم معالجتها بواسطة مزودي الخدمة هؤلاء نيابة عنا وعدم استخدامها أو الكشف عنها لأغراض أخرى بخلاف ما هو موجه من قبلنا ، مع مراعاة المتطلبات القانونية في المملكة المتحدة والدول الأجنبية الأخرى التي تنطبق على موقعنا. الشركات التابعة والوكلاء ومقدمي الخدمات ، على سبيل المثال المتطلبات القانونية للكشف عن المعلومات الشخصية للسلطات الحكومية في تلك البلدان. المعاملات التجارية: يجوز لنا استخدام معلوماتك الشخصية والإفصاح عنها لأطراف مرتبطة بالتمويل المتوخى أو الفعلي أو التوريق أو التأمين أو البيع أو التنازل أو التخلص من كل أو جزء من أعمالنا أو أصولنا (بما في ذلك ، على سبيل المثال ، حسابك معنا) ، للأغراض المتعلقة بتقييم وأداء هذه المعاملات ، بما في ذلك: السماح لهذه الأطراف بتقييم وتحديد ما إذا كانت ستستمر أو تستمر في المعاملة ، و الوفاء بمتطلبات أو التزامات الإبلاغ أو التفتيش أو التدقيق تجاه هذه الأطراف. يجوز لخلفائنا والمتنازل لهم و / أو أعمالهم أو أصولهم استخدام معلوماتك الشخصية والكشف عنها لأغراض مماثلة كما هو موضح في سياسة الخصوصية هذه. قانوني ، تنظيمي ، إلخ: قد تفصح TOTIPAY عن معلوماتك الشخصية عند الضرورة لتلبية المتطلبات القانونية والتنظيمية والتنظيمية الذاتية والتأمين والتدقيق والأمان ، وبخلاف ذلك بموافقتك أو وفقًا لما يسمح به القانون أو يقتضيه (بما في ذلك ما يقتضيه القانون القوانين المعمول بها في المملكة المتحدة والأجنبية). تطلب هيئة السلوك المالي في المملكة المتحدة (FCA) من جميع المؤسسات المالية بما في ذلك TOTIPAY التحقق على سبيل المثال لا الحصر من هوية العميل والغرض من المعاملة ومصدر الأموال. للامتثال لهذه المتطلبات التنظيمية ، سنقوم بإجراء المقارنة ، والتي تشمل أيضًا مشاركة المعلومات التي قدمتها ، على سبيل المثال لا الحصر ، الاسم والعنوان ورقم رخصة القيادة وأي معلومات أخرى واردة في تقرير المستهلك الخاص بك ، مع معرف متاح وذو سمعة طيبة مزود خدمة التحقق. ستستخدم هذه الوكالة المعلومات الواردة في تقرير المستهلك الخاص بك فقط لغرض التحقق من هويتك وليس غيرها. إذا لم نتمكن من التحقق من هويتك من خلال العملية عبر الإنترنت ، فسيتم توجيهك إلى عملية بديلة خارج الإنترنت. قد تكون هناك حاجة إلى دليل موثق إضافي لتحديد مصدر الأموال. كما تم تنظيم خدماتنا من قبل HMRC وتتوافق مع لوائح غسيل الأموال. موافقتك الموافقة على جمع واستخدام والكشف عن المعلومات الشخصية يمكن أن تعطى بطرق مختلفة. يمكن أن تكون الموافقة صريحة (على سبيل المثال ، شفهيًا أو إلكترونيًا أو على نموذج قد توقعه يصف الاستخدامات المقصودة والإفصاح عن المعلومات الشخصية) أو ضمنيًا (على سبيل المثال ، عندما تقدم المعلومات اللازمة لخدمة طلبتها). يمكنك تقديم موافقتك في بعض الظروف حيث تم تقديم إشعار لك بشأن نوايانا فيما يتعلق بمعلوماتك الشخصية ولم تسحب موافقتك لغرض محدد ، مثل استخدام خيار إلغاء الاشتراك المقدم ، إن وجد. قد يتم منح الموافقة من قبل ممثلك المفوض (مثل الوصي القانوني أو شخص لديه توكيل رسمي). بشكل عام ، من خلال تزويدنا بالمعلومات الشخصية ، سنفترض أنك توافق على جمع هذه المعلومات واستخدامها والإفصاح عنها للأغراض المحددة أو الموضحة في سياسة الخصوصية هذه ، إن وجدت ، أو غير ذلك في وقت التجميع. يمكنك سحب موافقتك على جمعنا للمعلومات الشخصية واستخدامها والكشف عنها في أي وقت ، مع مراعاة القيود التعاقدية والقانونية والإشعار المعقول. لاحظ أنه إذا سحبت موافقتك على استخدام معلوماتك الشخصية ، فقد لا نتمكن من تقديم خدمات معينة. لاحظ أيضًا أنه في حالة تقديمنا أو تقديم خدمات لك ، ستكون موافقتك سارية المفعول طالما كان ذلك ضروريًا للوفاء بالأغراض الموضحة في سياسة الخصوصية هذه أو غير ذلك في وقت الجمع ، وقد لا يُسمح لك بسحب الموافقة لبعض الاستخدامات والإفصاحات الضرورية (على سبيل المثال ، على سبيل المثال لا الحصر ، الاحتفاظ بسجلات وإفصاحات تجارية ومعاملات معقولة إلى المملكة المتحدة والكيانات الحكومية الأجنبية كما هو مطلوب للامتثال للقوانين). تجمع TOTIPAY معلوماتك الشخصية وتستخدمها وتفصح عنها بموافقتك ، باستثناء ما يسمح به القانون أو يقتضيه. قد يُطلب منا أو يُسمح لنا بموجب قوانين الولاية أو القوانين الفيدرالية أو اللوائح أو اللوائح الأجنبية بجمع المعلومات الشخصية أو استخدامها أو الكشف عنها دون موافقتك ، على سبيل المثال للامتثال لأمر من المحكمة ، للامتثال للوائح المحلية أو الفيدرالية أو قانونًا مسموحًا به الاستفسار من قبل وكالة حكومية ، أو لتحصيل الديون المستحقة لنا. الأمان تتخذ TOTIPAY جميع الخطوات المعقولة لحماية معلوماتك الشخصية باستخدام تدابير أمنية مادية أو إلكترونية أو إجرائية مناسبة لحساسية المعلومات الموجودة في عهدتنا أو سيطرتنا ، والتي قد تشمل ضمانات للحماية من الضياع أو السرقة ، فضلاً عن الوصول غير المصرح به ، والإفشاء ، النسخ أو الاستخدام أو التعديل. سيتمكن موظفونا والوكلاء والشركات التابعة لدينا المعتمدون الذين يحتاجون إلى الوصول إلى معلوماتك الشخصية من أجل الوفاء بمتطلبات وظيفتهم من الوصول إلى معلوماتك الشخصية. لدينا مجموعة من الضمانات الأمنية لحماية معلوماتك الشخصية من الضياع أو السرقة ، فضلاً عن الوصول غير المصرح به أو الكشف أو النسخ أو الاستخدام أو التعديل ، بغض النظر عن التنسيق الذي تم الاحتفاظ به. تعمل TOTIPAY على حماية معلومات التعريف الشخصية المخزنة على خادم الموقع من الوصول غير المصرح به باستخدام المعايير المتاحة تجاريًا والمقبولة صناعيًا لمنتجات أمان الكمبيوتر ، مثل جدران الحماية ، بالإضافة إلى إجراءات وممارسات الأمان المطورة بعناية. بالإضافة إلى ذلك ، مطلوب اسم مستخدم وكلمة مرور بشكل عام لاستخدام أو عرض أو تغيير معلومات التطبيق أو المقابلة. نحن نستخدم الموارد الداخلية والخارجية على حد سواء لمراجعة مدى كفاية التدابير الأمنية على أساس منتظم. تضمن TOTIPAY أن جميع الموظفين على دراية بأهمية الحفاظ على سرية المعلومات الشخصية. الوصول والتصحيح والاتصال بنا سوف تسمح لك TOTIPAY عند الطلب بالوصول إلى معلوماتك الشخصية. يجب توفير المعلومات المطلوبة أو إتاحتها بشكل مفهوم بشكل عام. في الحالات التي توضح فيها لنا أن أي معلومات نحتفظ بها غير دقيقة أو غير كاملة ، سنتخذ الإجراء المناسب لتعديل المعلومات كما هو مطلوب ، وإذا لزم الأمر ، نبلغ أي طرف ثالث بالتصحيح. قد تكون هناك ظروف تمنع TOTIPAY من توفير الوصول إلى بعض أو كل معلوماتك الشخصية. يمكن أن تكون هذه الظروف: قد تحتوي المعلومات على إشارات إلى أفراد آخرين ؛ أسباب قانونية أو استقصائية أو أمنية أو متعلقة بالملكية التجارية ؛ أو تخضع المعلومات للمحامي / العميل أو امتياز التقاضي. سياسة الخصوصية هذه على الرغم من أننا نبذل قصارى جهدنا للحفاظ على خصوصية المستخدم ، فقد نحتاج إلى الكشف عن المعلومات الشخصية عند الاقتضاء بموجب القانون حيث لدينا اعتقاد حسن النية بأن مثل هذا الإجراء ضروري للامتثال لإجراء قضائي حالي أو أمر محكمة أو إجراء قانوني قيد التنفيذ مواقعنا الإلكترونية. إخلاء المسؤولية القانونية يجوز مراجعة سياسة الخصوصية هذه من وقت لآخر. إذا كنا نعتزم استخدام المعلومات الشخصية أو الكشف عنها لأغراض مختلفة ماديًا عن تلك الموضحة في هذه السياسة ، فسنبذل جهودًا معقولة لإخطار الأفراد المتضررين ، إذا لزم الأمر ، بما في ذلك عن طريق مراجعة سياسة الخصوصية هذه. إذا كنت قلقًا بشأن كيفية استخدام معلوماتك الشخصية ، فيجب عليك الاتصال بنا على النحو الموضح أعلاه للحصول على نسخة حديثة من سياسة الخصوصية هذه. نحثك على طلب ومراجعة سياسة الخصوصية هذه بشكل متكرر للحصول على الإصدار الحالي. استمرار تقديمك للمعلومات الشخصية أو استخدام خدماتنا بعد أي تغييرات على سياسة الخصوصية هذه يشكل موافقتك على أي من هذه التغييرات. تغييرات سياسة الخصوصية أو اتصل بنا على +44-7508084715. إذا كنت ترغب في تقديم استفسارات أو شكاوى أو لديك مخاوف أخرى بشأن ممارسات المعلومات الشخصية لدينا ، يمكنك مراسلتنا على النحو الموضح أعلاه ، أو مراسلتنا عبر البريد الإلكتروني في آخر تعديل 25 أبريل 2018. info@totipay .com
