Repository: Waqasritman/TotiWalletIos
Catalog: Toti Wallet/StoryBoard/*.lproj/Localizable.strings
Languages: ar

# create
source: Create an account
ar: إنشاء حساب

# already
source: Existing customer
ar: عميل موجود

# textOffer
source: We offer you the best Foreign Exchange rates
ar: نقدم لك افضل سعر صرف

# already_have_an_account
source: Not an existing customer?
ar: العميل غير موجود؟

source: Sign In
ar: تسجيل الدخول

source: Skip
ar: تجاهل

source: Back
ar: العودة

source: Forgot PIN?
ar: نسيان كلمة المرور؟

source: First Name*
ar: الاسم الأول*

# Please_Enter_email_mobile_number
source: Please enter E-mail or Mobile number
ar: برجاء ادخال البريد الالكتروني او رقم الهاتف

# Please_select_agents
source: Please select available agent
ar: برجاء اختيار الوكيل المتوف

source: Address*
ar: العنوان*

source: E-mail*
ar: البريد الالكتروني*

source: Gender*
ar: الجنس*

source: Male
ar: ذكر

source: Female
ar: أنثى

source: KYC
ar: إستكمال الاجراءات

source: Quick Pay
ar: الدفع السريغ

source: Beneficiary
ar: المستفيد

source: History
ar: الحركات المالية

source: Bank name*
ar: اسم البنك*‬

# bank_account_number
source: Account number*
ar: رقم الحساب*‬

# ifsc_code
source: IFSC Code/IBAN No*
ar: رقم الايبان*

source: ID issue date
ar: تاريخ الاصدار

# id_expirey_date
source: ID expiry date*
ar: تاريخ الانتهاء*

source: Change PIN
ar: تغيير كود الدخول

source: Wallet
ar: المحفظة

source: Mobile number*
ar: رقم الجوال*

source: Sign Up
ar: تسجيل جديد

source: Payment done
ar: تم الدفع

source: Loyalty Program
ar: برنامج الولاء

source: More
ar: أكثر

source: Proceed To Pay
ar: إستكمال عملية الدفع

source: Select country
ar: حدد الدولة

source: City*
ar: المدينة*

# pay_qr_code
source: Pay via QR code
ar: الدفع باستخدم الكود

# enter_the_amount
source: Enter the amount you wish to load
ar: اختار المبلغ الذي ترغب بتحميله

# to_demo
source: To demo company 531264645
ar: إلى الشركة التجريبية رقم 531264645

source: About Us
ar: سياسة الخصوصية

# no_internet
source: Oops.. no internet connection available
ar: أووف -‬ لا يوجد اتصال بشبكة ألانترنت

source: About
ar: معلومات اكثر

source: Settings
ar: الإعدادات

source: Home
ar: البداية

source: Add Beneficiary
ar: إضافة مستفيد

source: Send now
ar: إرسل الان

source: Enter PIN
ar: إدخل الكود

source: Cancel
ar: إلغاء

source: Next
ar: التالي

source: Middle name
ar: الاسم الثاني

source: Nationality
ar: الجنسية

source: Purpose of transfer
ar: الغرض من التحويل

source: Bank code
ar: كود البنك

source: ID type
ar: نوع الوثيقة

# source_income
source: Source of income
ar: مصدر الدخل

# availiable_agents
source: Available agents
ar: الوكلاء المتوفرون

source: Country
ar: الدولة

source: Customer details
ar: بيانات العميل

source: Sending amount
ar: المبلغ المرسل

source: Exchange rate
ar: سعر الصرف

source: ID number
ar: رقم الجواز/البطاقة

source: TODO
ar: ما يجب عملة

# view_reciept
source: View receipt
ar: إستعراض

source: Total payable
ar: إجمالي المدفوع

source: Receiving amount
ar: المبلغ المستلم

# text_Referral
source: Referral code
ar: كود الارسال

source: Or
ar: أو

# card_no
source: Card number
ar: رقم الكرت‬

# resend_otp
source: Resend
ar: إعادة ارسال

source: Transaction Details
ar: بيانات التحويل

source: TXN number
ar: رقم

# date_amp_time
source: Date & Time
ar: والوقت & التاريخ

source: Payment Details
ar: بيانات الدفع‬

source: Sending currency
ar: العملة المحولة

source: Service fee
ar: خصومات اخرى

# vat_10_00
source: VAT/TAX
ar: الضريبة

source: Bank Details
ar: بيانات البنك

source: Branch
ar: الفرع

source: Name
ar: الاسم

source: ID expiry
ar: تاريخ انتهاء الجواز

source: Relation with beneficiary*
ar: العلاقة مع المستفيد*

source: Beneficiary Details
ar: بيانات المستفيد

source: Loyalty Points Details
ar: بيانات نقاط برنامج الولاء

# avail_points
source: Available points
ar: النقاط المتوفره

source: PayoutAgentName
ar: اسم الوكيل

source: Customer ID
ar: رقم العميل

source: Check rates
ar: راجع الاسعار

# best_rate
source: Currency Converter
ar: تحويل العملات

# lock_rate
source: Lock rate for 24 Hours
ar: حافظ على السعر لمدة ٢٤ ساعة

# please_complete_kyc
source: Please Complete your Registration
ar: برجاء اكمال اجراءات التسجيل

source: Select service provider
ar: إختار مقدم الخدمة

# mobile_rech
source: Mobile Recharge
ar: تعبئة الجوال اعادة

source: Add new account
ar: إضافة حساب جديد

# registerd_ac
source: Registered accounts
ar: الحسابات المسجلة

# how_send_money
source: How would you like to transfer
ar: اختار طريقة التحويل؟

# enter_your_amount_you_want_to_load
source: Enter the amount you wish to load
ar: إدخل المبلغ المراد تحويله

# my_cards_and_bank
source: My Cards
ar: بطاقاتي

source: Available cards
ar: البطاقات المتوفرة

source: +Add new
ar: + إضافة جديد

# add_card
source: + Add new card
ar: + إضافة كرت جديد

source: Available banks
ar: البنوك المتوفرة

source: Remove bank
ar: حذف بنك

# scan_code
source: Scan QR code
ar: قرأة الكود

# view_code
source: View my QR code
ar: إستعراض الكود الخاص بي

# please_select_bank_error
source: Please select bank
ar: من فضلك اختار البنك

# enter_account_no_error
source: Please enter account number
ar: إدخل رقم الحساب

# account_no_same_error
source: Account number should be same.
ar: يجب ان يكون رقم الحساب متطابق

# fscs_slect_error
source: Please select FSCS.
ar: من فضلك اختار تقنية التعرف على الوجه.

# convert_string
source: Convert
ar: حول

# send_otp_email
source: Send OTP via E-mail
ar: إرسل رمز الأمان الى البريد الالكتروني

# send_otp_mobile
source: Send OTP via Mobile
ar: إرسل رمز الامان الى الهاتف

# all_text
source: All
ar: الكل

# paid_text
source: Paid
ar: مدفوع

# received_text
source: Received
ar: مقبوض

# local_payments_txt
source: Local Payments
ar: المدفوعات المحلية

# inter_payments_txt
source: International Payments
ar: المدفوعات الدولية

source: Please enter amount
ar: قم بادخال المبلغ

# enter_name_bene_error
source: Enter beneficiary name
ar: ادخل اسم المستفيد

# plz_select_country_error
source: Please select country
ar: اختار الدولة

# plz_select_relation
source: Please select relation
ar: اختار صلة القرابة

# ifsc_text
source: IFSC code
ar: IFSC رمز

source: Search bank
ar: ابحث عن البنك

# enter_IFSC_code_error
source: Enter IFSC code
ar: ادخل IFSC رمز

source: Please select ID type
ar: من فضلك اختار نوع الهوية

# issuance_country
source: ID issuance country
ar: دولة الإصدار

# id_number_text
source: ID number*
ar: رقم الهوية*

# plz_select_country_code
source: Please select country code
ar: إختار رمز الدولة

# enter_mobile_no_error
source: Please enter mobile number
ar: إدخل رقم الهاتف

# first_name_text
source: First name
ar: الاسم الأول

# last_name_text
source: Last name
ar: الاسم الأخير

# enter_middle_name_error
source: Please enter middle name
ar: ادخل اسم الوالد

# enter_first_name
source: Please enter first name
ar: إدخل الاسم الأول

# enter_last_name
source: Please enter last name
ar: إدخل الاسم الأخير

# enter_dob_error
source: Please select date of birth
ar: إدخل تاريخ الميلاد

# enter_email_error
source: Please enter E-mail
ar: إدخل البريد الالكتروني

# select_gender
source: Please select gender
ar: إختار الجنس

# select_date_txt
source: Select date
ar: اختار التاريخ

# complete_profile
source: Complete your profile
ar: اكمال اجراءات التسجيل

source: Enter City Name
ar: اسم المدينة

# address_enter
source: Enter address
ar: العنوان

# select_nationlity
source: Select nationality
ar: الجنسية

# please_complete_kyc_text_dialog
source: Welcome to Totipay.Please complete your profile to enjoy the services.
ar: إهلا بك في توتي والت. اكمل بياناتك واستمتع بخدماتنا.

# proceed_text
source: Proceed
ar: استمر

# loading_txt
source: Loading...
ar: تحميل…

# select_source_income
source: Select the source
ar: اختار المصدر

# select_the_purpose_txt
source: Select the purpose
ar: اختار الغرض

source: View price break down
ar: استعرض تفاصيل المبلغ

# apply_txt
source: Apply
ar: قدم

source: Enter promo code
ar: ادخل كود العرض

# start_now_txt
source: Start Now
ar: إبدأ الأن

# id_and_proof_txt
source: ID and proof of address
ar: الهوية ووثيقة العنوان

# cool_selfie_your
source: A cool selfie of yours
ar: صورة شخصية لك

# all_u_need_is_txt
source: All you need is
ar: كلما تحتاجه هو

# verify_documentation
source: Please verify your documents to send or receive money
ar: برجاء التحقق من الوثائق المرفقه

# select_image_text
source: Select image
ar: قم باختيار صورة

# install_manager
source: Install gallery manager
ar: قم بتثبيت برنامج ادارة الصور

# plz_select_send_purpose_error
source: Please select purpose of transfer
ar: اختار الغرض من التحويل

# plz_select_source_of_income_error
source: Please select source of income
ar: اختار مصدر الدخل

# enter_name_bene__first_name_error
source: Enter first name
ar: ادخل الاسم الاول

# enter_name_bene__last_name_error
source: Enter last name
ar: ادخل اللقب

# enter_name_bene__middle_name_error
source: Enter middle name
ar: اسم الاب

# plz_enter_mobile_no
source: Enter mobile number
ar: رقم الهاتف المحمول

# enter_city_name_to_get_bank
source: Enter city name for banks
ar: المدينة أو البنك

# plz_enter_city
source: Please enter city name
ar: اسم المدينة

# how_would_you_like
source: How would you like to transfer?
ar: طريقة الدفع المفضلة

# purpose_of_transfer_txt
source: Purpose of transfer
ar: الغرض من التحويل

# send_money_via_cash
source: Cash pick-up service
ar: خدمة استلام التحويل

# bene_added_successfully
source: Beneficiary added successfully
ar: تمت اضافة المستقيد بنجاح

# send_otp_mobile_successfully
source: OTP sent successfully
ar: تم ارسال كلمة المرور( للاستخدام مره واحده )

# verify_otp_txt
source: Verify received OTP
ar: التحقق من كلمة المرور OTP

# askfordigit
source: Digit must be of mimimum 4 character
ar: عدد الارقام يجب ان لا يقل عن ٤

# attention_txt
source: Important!
ar: هام!

# otp_message
source: Your Totipay Wallet password is
ar: كلمة مرور محفظة Totipay الخاصة بك هي

# remember_me_otp
source: Please Use this OTP as login PIN in future.
ar: يرجى استخدام OTP هذا كرقم PIN لتسجيل الدخول في المستقبل.

# invalid_number
source: Invalid mobile number
ar: رقم تلفون المحمول غير صحيح

# how_would_you_like_to_login
source: How would you like to login into your account?
ar: كيف ترغب بالدخول الى حسابك؟

# using_mobile
source: Using Mobile number
ar: استخدم رقم الهاتف المحمول

# using_finger
source: Using FingerPrint
ar: استخدم البصمة

# log_in_to_account_txt
source: Login into your account
ar: تسجيل دخول الى الحساب

# pleaseenter_email_address
source: e-mail address
ar: البريد الالكتروني

# invalid_email_address_txt
source: Invalid E-mail address
ar: البريد الالكتروني غير صحيح

# enter_email_or_number_login
source: Enter E-mail or mobile number to login
ar: ادخل البريد الالكتروني او رقم الهاتف لتسجيل الدخول

# enter_mobile_no_txt
source: Enter your mobile number
ar: إدخل رقم الهاتف المحمول

# submitting_txt
source: By submitting you confirm you are not under the age of 18, and agree to terms & conditions and privacy policy.
ar: بالضغط على موافقه وارسال ان تقر ان عمر فوق ال ١٨ عاما وكل المعلومات صحيحة.

# accept_continue
source: Accept and continue
ar: موافقه واستمرار

# setup_password
source: Setup a password to make this app more secure
ar: أجعل التطبيق اكثر امانا من خلال تغيير اعدادات كلمة المرور

source: Create your profile
ar: قم بإنشاء سجلك الخاص

# middle_name_txt
source: Middle name*
ar: اسم الاب*

# last_name_text_m
source: Last name*
ar: اللقب /العائلة*

# date_of_birth_txt
source: Date of birth*
ar: تاريخ الميلاد*

# nationality_m
source: Nationality*
ar: الجنسية

# Please_Enter_email_txt
source: Please enter your e-mail address
ar: ادخل عنوان البريد الالكتروني

# Please_Enter_email_txt_phone
source: Enter your e-mail address or mobile number
ar: ادخل البريد الالكتروني او رقم الهاتف

# old_pin
source: Enter old Pin*
ar: أدخل رقم التعريف الشخصي القديم *

# new_pin
source: Enter new PIN*
ar: ادخل رمز المرور الجديد*

# confirm_pin
source: Re-enter new PIN*
ar: تكرار رمز المرور الجديد

# enter_old_pin
source: Please enter Old PIN
ar: *ادخل رمز المرور القديم

# enter_new_pin
source: Please enter New PIN
ar: تكرار رمز المرور الجديد

# enter_confirm_pin
source: Please re-enter new PIN
ar: تكرار رمز المرور

# pin_must_be_same
source: PIN doesn't match
ar: رمز المرور غير مطابق

source: PIN changed successfully
ar: تم تغيير رمز المرور بنجاح

# plz_select_sending_currency
source: Please select sending currency
ar: برجاء اختيار عملة التحويل

# plz_enter_valid_phone_or_email
source: Please enter valid E-mail address or mobile number
ar: قم بادخال رقم هاتف محمول او بريد الالكتروني صحيح

source: Transfer to
ar: ارسل إلى

# earn_points
source: Earned points
ar: اجمالي النقاط الحاصل عليها

# save_as_pdf_txt
source: Save as PDF
ar: حفظ نسخة PDF

# send_to_e_email
source: Send to E-mail
ar: ارسال الى البريد الالكتروني

# enter_email_or_number
source: Enter E-mail address or mobile number
ar: ادخل البريد الالكتروني او رقم الهاتف

# continue_txt
source: Continue
ar: استمرار

# pin_must_4_digit
source: Pin must be of 4 digits
ar: الرمز يجب ان لا يقل عن ٤ ارقام

# plz_enter_id_number
source: Please enter ID number
ar: قم بإدخال رقم الهوية

# plz_enter_id_expire_date
source: Please enter ID expiry date
ar: تاريخ الانتهاء

source: With Charges
ar: مع الرسوم

source: Without Charges
ar: بدون الرسوم

# setup_new_pin
source: Set a new PIN
ar: قم باعداد رمز جديد

# confirm_pin_txt
source: Confirm PIN
ar: قم بتاكيد الرمز

source: Skip for now
ar: تجاوز

# create_new_account_pin
source: Create a new PIN
ar: اعداد رمز جديد

# confirm_text
source: Confirm
ar: تم التأكد

# plz_complete_kyc
source: Sorry, you cannot perform this action. Your registration is not approved.
ar: للأسف لايمكنك اكمال هذه العملية … برجاء اكمال عملية التسجيل

# wallet_balance_txt
source: Wallet Balance
ar: الرصيد

source: Add Money to Wallet
ar: إضافة رصيد الى المحفظة

# transfer_to_bank_wallet
source: Transfer Money to Bank
ar: تحويل الى البنك

# plz_select_receiving_currency
source: Please select receiving currency
ar: أختار عملة التحويل

# send_moeny_to_wallet
source: Send Money to Wallet
ar: إرسال مبلغ الى المحفظة

source: Wallet name*
ar: اسم المحفظة*

# single_amount_txt
source: Amount*
ar: المبلغ*

# description_txt
source: Description*
ar: الوصف*

# wallet_des_hint
source: Money for new gadget
ar: مبلغ لاضافات جديده

# recever_name_error
source: Please enter receiver name
ar: اكتب اسم المستلم

# plz_enter_description
source: Please enter description
ar: الغرض / ملاحظات

source: Money Transfer
ar: المبلغ ارسال

# add_moeny_txt
source: Add Money
ar: إضافة المبلغ

# add_moeny_txtt
source: Add Money
ar: إضافةالمبلغ

# my_cards_txt
source: My Cards
ar: كروتي

source: Refer
ar: المرجع

# edit_profile_txt
source: Edit profile
ar: تعديل البيانات

source: Pay via QR code
ar: الدفع بواسطة رمز الQR

source: My QR Code
ar: رمز QR الخاص بي

# bill_payment_vc
source: Bill Payment
ar: دفع الفاتورة

# loyalty_points_txt
source: Loyalty Points
ar: نقاط برنامج الولاء

# refer_to_friends
source: Refer a Friend
ar: إشارة لصديق

# help_and_support_txt
source: Help and Support
ar: المساعدة والدعم

# resend_sms
source: Resend code in
ar: إعادة إرسال الرمز بتنسيق

# first_name_greate_than_3
source: First name must have 3 character
ar: الاسم الاول يجب ان لا يقل عن ٣ حروف

# middle_name_greate_than_3
source: Middle name must have 2 character
ar: الاسم الثاني يجب ان لايقل عن حرفين

# last_name_greate_than_3
source: Last name must have 3 character
ar: اللقب / العائلة يجب ان تقل عن ٣ احرف

# must_be_18_year_old
source: You must be 18+ year old to use Totiwallet
ar: يجب ان لا يقل عمرك عن ١٨ لاستخدام خدمات المحفظة

# first_name_special_character_not_allowed
source: Special character are not allowed in first name.
ar: لا يمكن ان يحتوي الاسم على حروف غير ابجديه

# last_name_spe_char
source: Special Character is not allowed in last name.
ar: لا يمكن ان يحتوي الاسم على حروف غير ابجديه

# middle_name_spe_char
source: Special Character is not allowed in middle name
ar: لا يمكن ان يحتوي الاسم على حروف غير ابجديه

# tap_back
source: Tap Once More to exit
ar: إضغط مره اخرى للخروج

# bene_name_special_character_not_allowed
source: Special character not allowed in beneficiary name
ar: لا يمكن ان يحتوي الاسم على حروف غير ابجديه

# account_no_must_be_8
source: Account number must be greater than 8 characters
ar: رقم الحساب يجب ان لا يقل عن ٨ ارقام

# select_currecny
source: Select currency
ar: إختار العملة

source: Select bank
ar: إختار البنك

# wallet_balance_txt_invalid
source: Insufficient wallet balance
ar: الرصيد غير كافي

source: Error getting image
ar: خطأ باستدعاء الصورة

source: + Add new card
ar: + أضف بطاقة جديدة

source: Use camera
ar: استخدام الكاميرا

source: Use gallery
ar: استخدام استديو الصور

source: Upload
ar: رفع

# plz_upload_front_image
source: Please Upload Your ID card (front side).
ar: برجاء رفع الوجه الامامي للهوية.

# plz_upload_back_image
source: Please Upload Your ID card (back side)
ar: برجاء رفع الوجه الخلفي للهوية

source: Using E-mail address
ar: استخدام البريد الالكتروني

# enter_number_error
source: Please enter number
ar: برجاء ادخل الرقم

# enteremaail_adress
source: Enter E-mail address
ar: ادخل البريد الالكتروني

# transaction_history
source: View transaction history
ar: مراجعة حركة الحساب

# wallet_traansaction_histry
source: View wallet history
ar: إستعراض حركة المحفظة

# successfully_tranfared
source: Successfully transferred
ar: تم النقل بنجاح

# plz_select_id_type
source: Please select ID type
ar: برجاء اختار نوع الهوية

# plz_select_issue_date
source: Please select ID issue date
ar: تاريخ الاصدار

# plz_select_expire_date
source: Please select expiry date
ar: تاريخ الانتهاء

# logout_txt
source: Logout
ar: خروج

# logout_message
source: Are you sure you want to logout?
ar: تأكيد الخروج؟

# wallet_traansaction_success
source: Successfully transferred to wallet account
ar: تم التحويل الى حساب المحفظة بنجاح

# your_qr_code
source: MY QR code
ar: رمز QR الخاص بي

# share_text
source: Share
ar: مشاركة

source: Gallery
ar: الاستوديو

# on_text
source: On
ar: مفتوح

# off_text
source: Off
ar: مغلق

source: Wallet To Wallet
ar: تحويل داخلي

source: Search
ar: بحث

# did_not_receive_otp
source: Did not received the OTP?
ar: لم يتم استلام رمز المرور؟

# msg_share_referral
source: Share Referral
ar: دعوة اصدقاء لاستخدام المحفظة

# share_message
source: Use this code to refer TotiWallet to your friends &amp; family and get rewarded once they Sign-Up
ar: استخدم هذا الرمز لدعوة اصدقائك &amp; وافراد عائلتك واحصل على نقاط وهدايا

# text_share_with_friend
source: Share With Friends
ar: دعوة اصدقائك

source: Share and earn
ar: شارك واربح

source: Remember me
ar: تذكرني

source: Exit
ar: خروج

# are_sure_exit
source: Are you sure you want to exit?
ar: تأكيد الخروج؟

source: Wallet history
ar: حركة حساب المحفظة

# transaction_history_txt
source: Transaction history
ar: إستعراض حركة العمليات

# repeat_txt
source: Repeat
ar: تكرار

# others_txt
source: Others
ar: أخرى

# share_with_whatspp
source: Share via Whatsapp
ar: شارك بواسطة واتساب

source: Select ID type
ar: اختار نوع الهوية

# thanks_message_for_submitting
source: Thank you for submitting the documents. Once approved you will be notified.
ar: شكرا لك مشاركتك الوثائق … سوف يتم ابلاغك في حال تم الموافقه عليها

# finish_txt
source: Finish
ar: إنهاء

# indi_account
source: TotiWallet Balance
ar: الرصيد

# complete_regi_txt
source: Complete your registration
ar: إكمال عملية التسجيل

# plz_upload_customer_image
source: Please upload a Selfie with your ID card
ar: برجاء رفع صورة سيلفي مع الهوية

# commission_amount
source: Commission
ar: العمولة

# name_on_card_txt
source: Name on card*
ar: الاسم على الكرت*

source: Number on card*
ar: الرقم على الكرت

source: Valid through*
ar: قابل للاستخدام حتى

source: Receiver name
ar: اسم المستلم

# send_now_txt
source: Send now
ar: الارسال الان

source: Request money
ar: اطلب مبلغ مالي

source: Capture
ar: التقاط

# select_beneficairy
source: Select beneficiary
ar: اختار المستفيد

source: Transfer Now
ar: إرسال الأن

source: Open camera
ar: إفتح الكاميرا

source: Choose from gallery
ar: اختار من الاستوديو

# session_out
source: Session time out
ar: نفذ الوقت المسموح من دون استخدام

# close_text
source: Close
ar: إغلاق

# login_text
source: Login
ar: تسجيل دخول

# toti_logout_auto_text
source: The application was inactive. Please re-login .
ar: الطلب خامل - برجاء اعادة الدخول .

# talfie_locked
source: TotiWallet is locked
ar: المحفظة مغلقة

# hide_break_down
source: Hide price break down
ar: إخفاء تفاصيل العملية

# description_txt_optional
source: Description
ar: الوصف

# name_hint
source: John Smith
ar: محمد

# request_money_from_wallet
source: Request money to your wallet
ar: اطلب مبلغ مالي الى حسابك

# okay
source: OK
ar: موافق

# request_money_message
source: Request sent successfully
ar: تم ارسال الطلب بنجاح

source: Edit
ar: تعديل

source: Update profile
ar: تحديث البيانات

source: Enter IFSC code
ar: أدخل رمز IFSC

# location_txt
source: Location
ar: الموقع

source: Branch name*
ar: اسم الفرع*

source: Enter bank details
ar: ادخل بيانات البنك

source: Select branch
ar: اختار الفرع

source: Enter location
ar: ادخل الموقع

source: Select bank name
ar: اختار اسم البنك

source: Search branch
ar: ابحث عن الفرع

# no_notification
source: No new notifications
ar: لا توجد اي تنبيهات

source: Bank Transfer
ar: تحويل بنكي

source: Cash Transfer
ar: تحويل نقدي

source: Coming soon
ar: قريبا..

# need_to_complete_kyc
source: Please complete your profile
ar: برجاء اختار ملفك الشخصي

source: Profile updated
ar: تم تعديل الملف الشخصي

# please_enter_details
source: Please enter required data
ar: الرجاء إدخال البيانات المطلوبة

# text_set_profile_photos
source: Choose image
ar: اختار الصورة

# text_camera
source: Camera
ar: الكاميره

# text_gallery
source: Gallery
ar: الاستوديو

# error_occured
source: Internal error please try again after some time.
ar: خطأ داخلي يرجى المحاولة بعد بعض الوقت.

# swift_transfer
source: Business Transaction
ar: تحويل تجاري

# enter_bene_personal_details
source: Enter beneficiary personal details
ar: ادخل بيانات المستلم

source: Beneficiary name/account title*
ar: اسم المستلم/عنوان الحساب *

# jhon_smith
source: John Smith
ar: محمد

# address_txt
source: Address
ar: العنوان

# contact_no
source: Contact number
ar: الرقم

# sending_amount_m
source: Sending amount*
ar: المبلغ المراد ارساله*

# receiving_amount_txt
source: Receiving amount
ar: المبلغ المستلم

# charges_txt
source: Charges
ar: تكاليف

source: Enter payment details
ar: ادخل تفاصيل الدفع

source: Enter beneficiary bank details
ar: ادخل بيانات بنك المستلم

# account_no_txt
source: Account number*
ar: رقم الحساب*

# bank_name_txt
source: Bank name
ar: اسم البنك

# bank_branch_txt
source: Bank branch*
ar: فرع البنك*

# bankaddress_txt
source: Bank address*
ar: عنوان البنك*

# swift_ibac
source: Swift BIC*
ar: سويفت BIC*

# enter_correspondent_detals
source: Enter correspondent details
ar: ادخل بيانات البنك الوسيط

source: Correspondent bank*
ar: البنك الوسيط*

# getting_data_loading
source: Getting data...
ar: الحصول على المعلومات…

# my_bene_list
source: My Beneficiary List
ar: قائمة المستفيدين

# beneficiary_details_txt
source: Beneficiary details
ar: بيانات المستفيد

# bene_name
source: Beneficiary name*
ar: اسم المستفيد*

# branch_name_txt
source: Branch name
ar: اسم الفرع

# acount_number
source: Account number
ar: رقم الحساب

# update_beneficary
source: Update beneficiary
ar: تحديث بيانات المستفيد

# delete_beneficary
source: Delete beneficiary
ar: حذف المستفيد

# mobile_number_txt
source: Mobile number
ar: رقم الهاتف

source: Pay out currency
ar: عملة الدفع

source: Payment branch
ar: فرع التسليم

source: Payout branch
ar: فرع الاستلام

source: Payout country
ar: الدولة

# sure_to_delete_bene
source: Are you sure to want to delete this beneficiary?
ar: هل تؤكد حذف المستفيد

# successfully_deleted_bene
source: Beneficiary deleted successfully
ar: حذف المستفيد تم بنجاح

# submit_txt
source: Submit
ar: ارسال

# rece_country
source: Receiving country*
ar: دولة الاستلام*
