Repository: Waqasritman/TotiWalletIos
Catalog: Toti Wallet/StoryBoard/*.lproj/Localizable.strings
Languages: ar

source: Request currency*
ar: عملة الطلب *

# plz_select_requesting_cur
source: Please select requesting currency
ar: الرجاء تحديد طلب العملة

# transaction_history_break
source: Transaction History
ar: عملية تجارية التاريخ

# wallet_history_break
source: Wallet History
ar: المحفظة التاريخ

source: Create Wallet
ar: خلق المحفظة

# wallet_currecny_txt
source: Select wallet*
ar: تحديد المحفظة*

# create_wallet_txt
source: Create Wallet
ar: خلق المحفظة

# select_new_wallet
source: Please select new wallet
ar: الرجاء تحديد المحفظة الجديدة

source: Create new wallet
ar: إنشاء محفظة جديدة

# contact_to_admin
source: sorry for the trouble, please contact to administrator
ar: آسف لهذه المشكلة ، يرجى الاتصال بالمسؤول

source: Update Available
ar: تحديث متوفر

# update_available_msg
source: Check out the latest version available of totipay application!
ar: تحقق من أحدث إصدار متاح من تطبيق totipay!

source: Close
ar: قريب

# update_txt
source: Update
ar: تحديث
