Repository: Waqasritman/TotiWalletIos
Catalog: Toti Wallet/StoryBoard/*.lproj/Localizable.strings
Languages: ar

# process_payment
source: Process payment through bank account
ar: عملية الدفع عن طريق البنك

# bank_details_txt
source: Bank Details
ar: بيانات البنك

# bank_depost_message
source: Please transfer/deposit the amount into the below bank account
ar: يرجى تحويل / إيداع المبلغ في الحساب المصرفي أدناه

# sort_code
source: Bank sort code
ar: كود نوع البنك

source: Account Number
ar: رقم الحساب

# bank_account_title_txt
source: Account title
ar: عنوان الحساب

# account_no_txt_
source: Account no
ar: رقم الحساب

# Business_account_txt
source: Business account
ar: حساب تجاري

# individual_reg
source: Individual registration
ar: تسجيل افراد

# bussiness_regis
source: Business registration
ar: تسجيل تجاري

# business_issue_country
source: Business issuance country
ar: دولة اصدار السجل التجاري

source: Business id type
ar: نوع هوية الحساب التجاري

# business_id_number_text
source: Business id number
ar: رقم الهوية

source: Business id issue date
ar: تاريخ الاصدار

# business_id_expirey_date
source: Business id expire date
ar: تاريخ الانتهاء

# Please_enteR_nmber
source: Please enter your mobile number
ar: برجاء ادخال رقم الهاتف

# account_no_txt_t
source: Account no
ar: رقم الحساب

# select_provider
source: Select Service Provider
ar: اختار مزود الخدمة

# searc_provider
source: Search Service Provider...
ar: بحث عن مزود الخدمة …

# save_card_txt
source: Save card for future payments
ar: حفظ بيانات الكرت للاستخدام المستقبلي

# add_cart_txt
source: Add Card
ar: اضافة كرت

# added_txt
source: Added
ar: تمت الاضافة

# to_wallet_txt
source: To Wallet
ar: إلى المحفظة

# view_wallet_txt
source: View Wallet
ar: عرض المحفظة

# bank_account_details
source: Bank account detail
ar: بيانات الحساب البنكي

# country_m
source: Country*
ar: الدولة*

# select_reltion_txt
source: Select the relation
ar: اختار صلة القرابة

# e_gift_txt
source: E-Gift
ar: هدية

# e_gft_sent
source: E-Gift Sent
ar: ارسال هدية

# receiver_name_m
source: Receiver name
ar: اسم المستلم

source: Customer name
ar: اسم العميل

source: Service provider
ar: مزود الخدمة

source: Add Account
ar: إضافة الحساب

source: Mobile top-up
ar: اضافة حساب للهاتف

source: Select operator
ar: اختار شبكة الاتصالات

source: Browse plans
ar: تصفح خطط مزود الخدمة

# amount_text
source: Amount*
ar: المبلغ*

# receiving_txt
source: Receiving
ar: يتم الاستلام

# validity_txt
source: Validity
ar: الصلاحية

# money_added_towallet_txt
source: Money Added to wallet
ar: تم اضافة المبلغ الى المحفظة

# swipe_to_see
source: Swipe to see more
ar: حرك لمشاهدة المزيد

# more_platform
source: More platforms
ar: منصات اخرى

source: Wallet transfer
ar: تحويل المحفظة

# enter_the_amount_togift
source: Enter the amount you want to gift
ar: اكتب المبلغ الذي ترغب باهدائه

# write_personal_msg
source: Write your personalised message
ar: اكتب الرساله التي ترغب بارسالها

# send_money_txt
source: Send Money
ar: ارسل المبلغ

# request_money_btn
source: Request Money
ar: طلب مبلغ مالي

# bene_name_m
source: Beneficiary name*
ar: اسم المستفيد*

# select_country_m
source: Select country*
ar: إختار الدولة*

# select_the_relation_txt
source: Select the relation
ar: اختار صلة القرابة

# city_name_m
source: City name*
ar: اسم المدينة*

# location_txt_m
source: Location*
ar: الموقع*

# re_enter_account_no_m
source: Re Enter Account Number*
ar: تأكيد رقم الحساب*

# local_transfer
source: To other wallet
ar: تحويل داخلي

# inter_transfer
source: International Transfer
ar: تحويل دولي

# no_bene_found
source: No beneficiary found
ar: لا يوجد مستفيد

# acount_number_m
source: Account number*
ar: رقم الحساب*

# receiver_mobile_no
source: Receiver mobile number
ar: رقم هاتف المستفيد

# check_rates_home
source: Check Rates
ar: تأكد السعر

# enter_valid_card_number
source: Please enter valid card number
ar: برجاء التحقق من رقم الكرت

# plz_enter_valid_expire_date
source: Please enter valid expire date
ar: برجاء التحقق من تاريخ انتهاء الكرت

# plz_enter_valid_cvv
source: Please enter valid cvv
ar: برجاء التحقق من رقمcvv

# enter_valid_moth
source: Enter a valid month
ar: ادخل الشهر

# wallet_load_successfully
source: Amount added successfully to wallet
ar: تمت اضافة المبلغ بنجاح

source: Amount added
ar: تمت اضافة المبلغ

# receiving_amount_m
source: Receiving amount*
ar: المبلغ المستلم*

# charges_txt_m
source: Charges*
ar: التكاليف*

# purpose_of_transfer_m
source: Purpose of transfer*
ar: الغرض من التحويل*

# others_txt_m
source: Others*
ar: أخرى

source: Trade
ar: تبادل تجاري

# enter_rece_country
source: Enter receiving country
ar: ادخل الدولة

# enter_purpose_of_transfer
source: Enter the purpose of transfer
ar: ادخل الغرض من التحويل

source: Save as image
ar: حفظ كصورة

# wallet_to_wallet_summary
source: Please confirm the below details for wallet transfer
ar: برجاء تاكيد البيانات

# wallet_name_txt
source: Wallet name
ar: اسم المحفظة

# amount_text_
source: Amount
ar: المبلغ

source: Image Saved
ar: تم حفظ الصورة

source: Select wallet
ar: إختار المحفظة

# special_character_not_all
source: Special character not allowed in description
ar: استخدم الحروف والارقام من غير اي علامات ترقيم

# receiving__currency_txt
source: Receiving currency
ar: عملة المستلم

source: British Pound
ar: جنية إسترليني

source: Euro
ar: يورو

# un_dollar
source: United states dollar
ar: دولار امريكي

# balance_text
source: Balance
ar: ألرصيد

# please_select_wallet_account
source: Select the wallet you wish to load
ar: إختار المحفظة

source: No history found
ar: لا توجد حركة حساب

source: Select type
ar: اختار النوع

source: Select category
ar: اختار الفئة

# plz_select_top_up_type
source: Please select top up type
ar: من فضلك اختار طريقة التعبئة

# select_plan
source: Select mobile top up plan
ar: اختار العرض

source: Choose Plan
ar: اختار خطة العرض

# select_plan_txt
source: Select plan
ar: اختار خطة العرض

# plz_select_category
source: Please select category
ar: إختار الفئة

# plz_select_operator
source: Please select operator
ar: إختار الفئة

source: Biller name
ar: الاسم

# amount_payable
source: Payable amount
ar: المبلغ المستحق

source: Available wallets
ar: المحافظ المتوفره

source: Choose wallet
ar: اختار المحفظة

# plz_select_country_for_payment
source: Please select country
ar: اختار الدولة

# select_recharge_type
source: Please select billing type
ar: اختار طريقة الدفع

# select_utility_bill
source: Please select bill
ar: الفاتورة

# plz_select_bill_comppany
source: Please select company
ar: اختار الشركة

# enter_swift_bic
source: Enter swift bic number
ar: ادخل رمز البنك ( سويفت )

# enter_bank_branch
source: Please enter bank branch
ar: اختار فرع البنك

# bankaddress_txt_error
source: Please enter bank address
ar: ادخل عنوان فرع البنك

# plz_enter_swift_ibc
source: Please enter swift bic number
ar: ادخل كود البنك ( سويفت)

# plz_enter_uitlitu_payment_account
source: Please enter account no of utility
ar: ادخل الحساب الخاص بالفاتورة

source: Select receiver wallet
ar: اختار محفظة المستلم

source: Send money via bank
ar: تحويل بنكي

# mobile_top_up_home
source: Mobile Top up
ar: تعبئة رصيد هاتف

# biller_name_home
source: Bill Payments
ar: المدفوعات فواتير

# prepaid_card_home
source: Prepaid Cards
ar: بطائق مسبقة الدفع

# offer_of_home
source: Offers for you
ar: عروض

source: Received from
ar: المرسل

source: Utility bill
ar: الفواتير المنزلية

source: Account name*
ar: اسم الحساب*

# account_no_policy
source: Account/Policy no
ar: الحساب

# re_account_no_policy
source: Re enter Account/Policy no
ar: تاكيد رقم الحساب

# account_policy_no_must_be_same
source: Account/Policy no must be the same
ar: رقم الحساب /يجب ان يتطابق

# enter_cvv
source: Enter security code
ar: ادخل رمز الامان

# load_cards
source: Load saved cards
ar: تحميل البطائق المحفوظة

# pay_thorough_card
source: Pay through card
ar: الدفع بواسطة البطاقة

# pay_thorough_bank
source: Pay through bank
ar: الدفع بواسطة البنك

# pay_thorough_wallet
source: Pay through wallet
ar: الدفع بواسطة المحفظة

# bill_details
source: Bill details to pay
ar: بيانات الفاتورة

source: Due date
ar: تاريخ الاستحقاق

# save_transaction_receipt
source: Saved Transaction Receipt
ar: حفظ سند الدفع

source: Something wrong
ar: خطاء

# relation_with_beneficiary_txt
source: Relation with beneficiary
ar: صلة القرابة مع المستلم

# john_txt
source: John
ar: AbdulFattah

source: Smith
ar: Alghurbani

source: In process
ar: نفيذ الاجراءات

# in_process_msg_card
source: Thanks for using Totipay Service. We will notify once payment is processed
ar: شكرا لاستخدامك خدمة توتي باي للدفع سوف نقوم بابلاغك عند اكتمال عملية الدفع

# refer_no
source: Reference no
ar: رقم المرجع

# bill_payment_tool_title
source: Bill Payment
ar: دفع الفواتير

# prepaid_card_title
source: Prepaid Cards
ar: بطائق مسبقة الدفع

source: Prepaid card number
ar: بيانات البطاقة

source: Generate prepaid card
ar: إنشاء بطاقة مسبقة الدفع

# confirm_title_money
source: Please confirm the below details for the money transfer
ar: الرجاء التحقق وتاكيد البيانات

source: Transfer amount
ar: المبلغ المحول

source: Summary
ar: ملخص

source: Cash Beneficiary
ar: مستفيدون /نقدا

# bank_beneficairy
source: Bank Beneficiary
ar: مستفيدون / تحويل بنكي

# enter_pin_tosend
source: Please verify your pin for money transfer
ar: برجاء التحقق من الرمز لاكمال عملية التحويل

# cancel_tran
source: Return to home
ar: العودة الى الشاشة الرئيسية

# cancel_transaction_text
source: Are you sure you want to go to home?
ar: هل تريد العودة الى شاشة البداية؟

# to_own_account
source: To own wallet
ar: مالك المحفظة

# convert_currency_home
source: Own Wallet Transfer
ar: صرف العملة

# send_moeny_to_wallet_your_own
source: Send money to your own wallet
ar: ارسال الى محفظتك

source: Our Rates
ar: الاسعار

# server_error
source: Server error try again later.
ar: خطاء في الخادم الرجاء المحاولة لاحقا.

source: Load Card
ar: تحميل البطاقة

source: My Card
ar: بطاقاتي

source: Enter your amount*
ar: ادخل المبلغ

# or_pick_qucik_amount
source: Or pick a quick amount
ar: اختار مبلغ

# enter_txt
source: Enter
ar: ادخال

source: Correct
ar: نعم

source: Select utility bill type
ar: اختار نوع الفاتورة

source: Payment
ar: المدفوعات

source: Select city*
ar: المدينة*

source: Select location*
ar: الموقع*

# select_city_txt
source: Select city
ar: المدينة

# select_location_txt
source: Select location
ar: الموقع

# select_branch_m
source: Select branch*
ar: الفرع*

# select_city_error
source: Please select city
ar: المدينة

source: Yemini Riyal
ar: ريال يمني

source: Gold
ar: ذهب

source: IBAN number*
ar: IBAN رقم*

source: Enter Iban number
ar: ادخال Iban رقم

# plz_generate_your_card
source: Please generate your card
ar: الرجاء إنشاء بطاقتك

# maximum_amount_of_top_is_2000
source: Amount of top-up between USD 100 to USD 2000
ar: مبلغ زيادة الرصيد بين 100 دولار أمريكي و 2000 دولار أمريكي

source: Note:
ar: ملحوظة:

source: FAQ
ar: التعليمات

# faq_q1
source: How much does it cost to make a personal money transfer abroad?
ar: ما هي تكلفة تحويل الأموال إلى الخارج؟

# faq_q2
source: Where can I transfer money to?
ar: إلى أين يمكنني تحويل الأموال؟

# faq_q3
source: How long does an international currency transfer take?
ar: كم من الوقت يستغرق تحويل العملات الدولي؟

# faq_q4
source: How do I make a personal international money transfer?
ar: كيف أقوم بتحويل أموال دولي شخصي؟

# faq_q5
source: Why use Totipay over my bank?
ar: لماذا تستخدم Totipay عبر البنك الذي أتعامل معه؟

# faq_q6
source: How long will it take before the funds are available for the beneficiary?
ar: كم من الوقت سيستغرق قبل أن تصبح الأموال متاحة للمستفيد؟

# faq_q7
source: Where can I find Totipay money transfer locations?
ar: أين يمكنني العثور على مواقع تحويل الأموال في Totipay؟

# faq_q8
source: How can I contact a Totipay money transfer agent?
ar: كيف يمكنني الاتصال بوكيل تحويل الأموال Totipay؟

# faq_q9
source: Is there a cash limit for money transfer?
ar: هل يوجد حد نقدي لتحويل الأموال؟

# faq_q10
source: What if I provide a wrong account number on my transfer?
ar: ماذا لو قدمت رقم الحساب الخاطئ في التحويل الخاص بي؟

# faq_q11
source: Can I transfer money in the same country with Totipay money transfer?
ar: هل يمكنني تحويل الأموال في نفس البلد باستخدام Totipay لتحويل الأموال؟

# faq_q12
source: Can I cancel a transfer and get a refund?
ar: هل يمكنني إلغاء التحويل واسترداد الأموال؟

# faq_q13
source: What are considered as valid ID documents?
ar: ما هي وثائق الهوية الصالحة؟

# faq_ans_1
source: Totipay customers can enjoy worldwide money transfers with a £5 transfer fee. Generally, banks will charge £15 - £30 no matter the amount being sent. Fees aside, our customers will make further savings through the very competitive exchange rates that we use.
ar: يمكن لعملاء Totipay الاستمتاع بتحويل الأموال في جميع أنحاء العالم مقابل رسوم تحويل قدرها 5 جنيهات إسترلينية. بشكل عام ، ستفرض البنوك رسومًا من 15 إلى 30 جنيهًا إسترلينيًا بغض النظر عن المبلغ الذي يتم إرساله. بصرف النظر عن الرسوم ، سيحقق عملاؤنا المزيد من المدخرات من خلال أسعار الصرف التنافسية للغاية التي نستخدمها.

# faq_ans_2
source: Totipay has a growing number of countries to which you can transfer money and exchange currencies. Please refer to the drop-down list on the site.
ar: يوجد في Totipay عدد متزايد من البلدان التي يمكنك تحويل الأموال وتبادل العملات إليها. يرجى الرجوع إلى القائمة المنسدلة على الموقع.

# faq_ans_3
source: This depends on a number of factors, like, where the funds are sent from, where the funds are going, and in which currency you are sending them etc. However, generally, this process is very fast.
ar: يعتمد هذا على عدد من العوامل ، مثل ، من أين يتم إرسال الأموال ، وإلى أين تذهب ، والعملة التي ترسلها إليها وما إلى ذلك. ومع ذلك ، بشكل عام ، هذه العملية سريعة جدًا.

# faq_ans_4
source: It's really simple: Register with Totipay Login to your account & get a live exchange rate quote Enter the recipient bank account details to book your money transfer Send us the funds, relax and we'll deliver the funds to your nominated bank account as quickly as possible.
ar: الأمر بسيط حقًا: سجل مع Totipay تسجيل الدخول إلى حسابك والحصول على عرض أسعار الصرف الحية أدخل تفاصيل الحساب المصرفي للمستلم لحجز تحويل الأموال أرسل لنا الأموال ، واسترخي وسنقوم بتسليم الأموال إلى حسابك المصرفي المحدد في أسرع وقت ممكن

# faq_ans_5
source: High street banks may have been around a lot longer than specialist currency brokers like Totipay, but they remain uncompetitive when it comes to helping people transfer money internationally. Not just uncompetitive with their exchange rates and high fees, but also with their levels of customer service and specialist foreign exchange knowledge. Better exchange rates than any bank £5 transfer fee (Max) 24/7 access to our experts Speedy currency transfers Regulated by the Financial Conduct Authority Different types of transfers available Use Totipay when: Emigrating or moving overseas. Buying or selling property abroad Making overseas purchase Investing overseas Sending money to family and friends Making regular payments abroad
ar: ربما كانت البنوك الكبرى موجودة لفترة أطول بكثير من وسطاء العملات المتخصصين مثل Totipay ، لكنها تظل غير قادرة على المنافسة عندما يتعلق الأمر بمساعدة الأشخاص في تحويل الأموال دوليًا. ليس فقط غير قادرة على المنافسة فيما يتعلق بأسعار الصرف والرسوم المرتفعة ، ولكن أيضًا مع مستويات خدمة العملاء والمعرفة المتخصصة بالنقد الأجنبي. أسعار صرف أفضل من أي بنك رسوم تحويل 5 جنيهات إسترلينية (بحد أقصى) 24/7 الوصول إلى خبرائنا سرعة تحويل العملات تنظمها هيئة السلوك المالي أنواع مختلفة من التحويلات المتاحة استخدم Totipay عندما: الهجرة أو السفر إلى الخارج. شراء أو بيع العقارات في الخارج الشراء من الخارج الاستثمار في الخارج إرسال الأموال إلى العائلة والأصدقاء القيام بمدفوعات منتظمة في الخارج

# faq_ans_6
source: This is normally a maximum of 24 hours, however, this does depend on the country and mode of payment. You can contact us for advice regarding your sending options and destinations.
ar: هذا عادة ما يكون بحد أقصى 24 ساعة ، ومع ذلك ، فإن هذا يعتمد على البلد وطريقة الدفع. يمكنك الاتصال بنا للحصول على المشورة بشأن خيارات الإرسال والوجهات الخاصة بك.

# faq_ans_7
source: Totipay money transfer has its own branches as well as a wide network of agents all over the UK. If you wish to find an agent or are interested in becoming an agent, we would be happy to hear from you. Please contact us.
ar: تمتلك Totipay لتحويل الأموال فروعًا خاصة بها بالإضافة إلى شبكة واسعة من الوكلاء في جميع أنحاء المملكة المتحدة. إذا كنت ترغب في العثور على وكيل أو ترغب في أن تصبح وكيلاً ، يسعدنا أن نسمع منك. الرجاء التواصل معنا.

# faq_ans_8
source: You can contact us via phone, fax or email and we will find the closest agent to you.
ar: يمكنك الاتصال بنا عبر الهاتف أو الفاكس أو البريد الإلكتروني وسنجد أقرب وكيل إليك.

# faq_ans_9
source: Unfortunately, there is. The cash limit for money transfer in a day is £5000. An ID will be required when £3000 and above is being transferred.
ar: لسوء الحظ ، هناك. الحد النقدي لتحويل الأموال في اليوم هو 5000 جنيه إسترليني. سيُطلب إثبات الهوية عند تحويل 3000 جنيه إسترليني وما فوق

# faq_ans_10
source: Incorrect information may cause delays in the payment. Please contact us in such instances and correct the information that you have provided as soon as possible.
ar: قد تتسبب المعلومات غير الصحيحة في تأخير الدفع. يرجى الاتصال بنا في مثل هذه الحالات وتصحيح المعلومات التي قدمتها في أسرع وقت ممكن

# faq_ans_11
source: Yes, you can transfer money with our agencies in the same country.
ar: نعم ، يمكنك تحويل الأموال مع وكالاتنا في نفس البلد.

# faq_ans_12
source: To cancel a money transfer or request a refund, kindly contact us. Please note that we will be unable to carry out a refund if the transaction has been paid.
ar: لإلغاء تحويل الأموال أو طلب استرداد ، يرجى الاتصال بنا. يرجى ملاحظة أننا لن نتمكن من إجراء استرداد إذا تم دفع المعاملة.

# terms
source: Terms & Conditions
ar: البنود و الظروف

# privacy
source: Privacy Policy
ar: سياسة الخصوصية

# faq_ans_13
source: As proof of identification, you can use a passport or your country of residence's official identity document. For the use of other types of documents, please contact us for verification. Documents must be valid within the expiration date
ar: كدليل على الهوية ، يمكنك استخدام جواز السفر أو وثيقة الهوية الرسمية لبلد إقامتك. لاستخدام أنواع أخرى من المستندات ، يرجى الاتصال بنا للتحقق. يجب أن تكون المستندات صالحة في تاريخ انتهاء الصلاحية
