Repository: Waqasritman/TotiWalletIos
Catalog: Toti Wallet/StoryBoard/*.lproj/Localizable.strings
Languages: ar

# terms_text
source: You can contact us at info@totipay.com or by Our registered office address is 14 Charles Walk, Rowley Regis, England, B65 9ED and head office is at TotiPay Ltd, Office 513, 5th Floor, Quayside Tower, Broad Street, Birmingham B1 2HF You means the user of the website operated by Totipay. This website (www.totipay.com) is operated and owned by Totipay with company registration number is; 10338529 (hereafter referred to as Totipay).mailing us by post. The use and access to the Totipay Websiteis provided on the basis of the following terms and conditions: 1. Changes to the Website 1.1 Totipay may from time to time make such changes to the content of the Website or the products and services it offers. 1.2 Totipay may withdraw such services and products as considered appropriate. 1.3 Totipay may terminate your access or use of the Website if there is any breach of our terms or conditions or in the case of breach of law orregulation . Totipay reserves the right to use various procedures to authenticate each transaction including identity checks. Totipay reserves the right to decline or to discontinue processing any part of your order at any time. 1.4 Totipay may discontinue the operation of the Website. 2. Permitted access to the Website 2.1 You should not use the Website from any country where accessing or using the Website or any of the information, products or services on it is prohibited by law. This Website does not constituteany invitation or solicitation by Totipay to any person to use any such information, products or services in countries where to do so is prohibited by law. 3. Reliance on Information posted 3.1 Totipay shall use its reasonableendeavours to ensure that any dated information contained or reproduced on the Website is up to date at the stated date of its publication. Totipay does not accept any responsibility to update or amend any information. The information or content provided by the Website may be out of date at any given time. 4. Restrictions on the use of the Website 4.1 The content of the Website and the products and services made available by Totipay on the Website are intended for use by holiday or businesstravellers or by individuals or corporations seeking to purchase currencies for the purpose of business or travel, and should not be used for speculation or investment. 5. Intellectual Property 5.1 All intellectual property and all materials comprising or contained in the Website but not limited to all text/articles, logos, softwareand images, are owned, or licensed, except as otherwise expressly stated, by Totipay. 5.2 You are entitled to access the Website for the purposes of accessing the facilities offered by Totipay. However you may not use the Website or its contents in any way, directly or indirectly, for any other purpose. The materials on the Website may not be copied or redistributed for commercial purpose or for compensation of any kind without written permission from Totipay. 6. Links to other websites 6.1 This Website contains links to third party websites. Such links are provided for your convenience. 6.2 Totipay has no control over publications by third party websites. Totipay does not warrant the content or accuracy of such third party websites nor does Totipay accept responsibility or liability in relation to the content or products offered by thesites . 7. Limitations On Liability 7.1 All content shown on the Website including the services and products we provide are made available without any warranties, conditions or guarantees given by Totipay. All such warranties, conditions or guarantees which would otherwise be implied by law are excluded to the fullest extent permitted by law. In particular, Totipay does not warrant the accuracy, suitability, reliability, completeness, performance and/or fitness for purpose of the content of any services or products available on this Website. 7.2 Totipay uses reasonable skill and care in providing its products and services to you. However (to the maximum extent permitted by law) Totipay is not liable to you for any loss, damage, claim or compensation (including loss of profit or loss of use) arising out of: 7.2.1 your use, delay or inability to use this Website; 7.2.2 any inability to perform any of Totipay's obligations due tofailure of any technical or computer systems; 7.2.3 any reasons beyond Totipay's reasonable control. This will include (amongst other things) war, terrorism, government action, natural disaster, and industrial disputes; 7.2.4 any damage to your computer equipment as a result of using this Website or any products or services provided from it; 7.2.5 any change in foreign currency rates which may occur from time to time. 7.3 Without limiting the more general exclusions of liability as set out in sections 7.1 and 7.2, (to the maximum extent permitted by law) Totipay is not liable to you for any loss of profit, loss of use, indirect, or consequential losses, claims or other damages suffered or incurred by you from the use of the Website or products or services itofferes. 7.4 Totipay's maximum aggregate liability to you in respect of all foreign currency transactions undertaken by you shall be limited to a refund equivalent to anymoneys you have paid to Totipay to acquire foreign currency. 7.5 Totipay does not warrant that the Website is free of viruses or of other material which is malicious or technologically harmful. Totipay is not liable for any viruses for other technologically harmful material that may affect your computer equipment, computer programs or other material resulting from your use of the Website. 7.6 The disclaimers and limitations of liability in these terms and conditions shall not apply to any damages arising from death or personal injury caused by the negligence of Totipay or any of its employees or agents or for fraud. 7.7 Totipay does not accept any liability for loss occasioned by fraudulent spending or any other unauthorized use of the service but will assist its customers in preparing a claim for submission to the appropriate third partieswhere requested to do so. 7.8 If any provisions of these terms and conditions including these disclaimers and limitations shall be unlawful or unenforceable then such provisions shall fall away and shall not affect the validity and enforceability of the remaining terms. Your statutory rights remain unaffected. 8. Privacy And Data Protection Totipay processes information about you in accordance with its privacy policy. By using the website you consent to such processes and confirm that all data you provide is accurate. Governing Laws and Changes to These Terms and Conditions 9. Use of Website The use of the Website and these terms and conditionsis governed by the Laws of England and Wales. 10. Disputes All Disputes arising out of the use of the Website and/or any services or products provided by Totipay or any dispute relating to these terms and conditions shall be resolved by the courts Of England And Wales. 11. Right to change Totipay reserves the right to change these terms and conditions from time to time. You should check these terms and conditions every time you use the Website. By using the Website you will be treated as having consented to these terms and conditions and/or any revised terms and conditions which may appear from time to time. Provisions Relating To Placing Of The Order And When The Contract Between You And Top Connect Is Formed. 1. Orders through the Website must only be placed by individuals over the age of 18. 2. On the Website Totipay makes available currency for purchase in respect of holiday and business travel etc., (but not for investment or speculation). 3. Please follow the steps on the screen in order to place an order. Totipay reserves the right to request further information in order to process your order. 4. Totipay will use various procedures to authenticate each transaction for the purposes of law and regulations including anti-money laundering regulations. Totipay reserves the right to decline or process any part of your order at any time. 5. You will be able to edit the details of your order any time up until you press the Book Now button. 6. Totipay will send you an email acknowledgement of your order once it has received it but please note that this is an acknowledgement only and does not mean acceptance of your order by Totipay. 7. Once you have placed your order for money transfer on our Website or via phone or via visiting our office or branch, you authorise Top Connect tOnce you have placed your order for money transfer on our Website or via phone or via visiting our office or branch, you authorise Totipay to action your order and hence you will not be allowed to cancel the orderit subject to the cancellation policy set out in paragraph 8 below. Should you wish to make any amendments to your order, Totipay will use its reasonable endeavors to accommodate your needs but the final decision is down to our sole discretion. If you wish to amend your order please send an e-mail to our manager at info@totipay.com. Any such amendments will be subject to the applicable foreign exchange rates as published on the Website by Totipay from time to time. If Totipay agrees to amend you order you will receive an e-mail to confirm this. However Totipay is under no obligation to accept any such amendments to your order and Totipay accepts no liability or responsibility in the event that it decides not to do so. 8. You may cancel your order by providing Totipay with written notice of cancellation, by email to info@totipay.com at the earliest opportunity. Please note that by this time, Totipay may have purchased your Cedi order at the foreign exchange rate of that day. In the case of cancellation you will receive a refund at the foreign exchange rate prevailing at the time of cancellation of the order which may be different to the foreign exchange rate at the time of your order as the Cedi, GBP and US dollar exchange rates fluctuate. 9. All orders are subject to acceptance by Totipay and Totipay will confirm such acceptance by email indicating that your order has been accepted. The contract between Totipay and you will only be formed once Totipay sends you the confirmation email that your order has been accepted. Until that time there will be no binding arrangement for Totipay to supply you with any money transfer service, foreign exchange or other services. You should print and retain a copy of the confirmation email for your records or the receipt slip that will be provided to you by Totipay. 10. Totipay is not obliged to accept any order and may decline to do so for any reason Price, Availability And Delivery 11. Your money transfer request will be delivered at the time of your instruction. 12. The GBP price payable for Cedi that you wish to send will be as shown on the confirmation screen and will be only valid for a short period of time as Foreign exchange rates fluctuates regularly . If you do not submit your order immediately you enter the confirmation screen the price many change and you will need to enter the screen again to see the updated price. 13. Totipay have the right to revise and amend these terms and conditions from time to time. You will be subject to the terms and conditions in force at the time you place your order with Totipay. By placing an order you agree to the terms and conditions in force at the time the order is made. 14. Totipay is entitled to refuse, withdraw or cancel your money transfer order at anytime, for any reason. Totipay may terminate any money transfer order at any time. 15. Please be advised that certain requests may be beyond Totipay's control. As such, Totipay accepts no liability for such actions. If you pay by card, please note that Totipay does not refund charges made by your card issuer and that the late cancellation fee may also be subject to a cash advance fee from your card issuer. Totipay May Also Terminate Any Contract It Has With You If It Is Required To Do So On Instructions Of Any Law Enforcement Agency Or Regulatory Body. In This Case Totipay May Retain All Or Any Of Your Money If It Is Required To Do So By Law And Then Deal With It As Ordered By A Court Or Other Body Of Competent Jurisdiction. As a Money Services Business (MSB), Totipay is registered and regulated by HM Customs & Excise under Money Laundering Regulations and licensed by the FCA as a PaymentInstitution.. Our staff are fully conversant with Anti-Money Laundering guidelines and are aware of their responsibilities in the monitoring and reporting of any actions that raise suspicion or give cause for concern. Totipay reserves the right to perform identity checks in accordance with the terms and conditions on all individuals who place an order on the website. For further information on these identity checks please contact info@totipay.com. Totipay reserves the right at all times to refuse to process any foreign currency order which it believes in its sole discretion, is connected in any manner of unlawful or illegal purpose. We have a legal obligation to report to Customs and Excise or NCIS any such suspicious transactions. Totipay is obliged by law to monitor any unusual or suspicious transactions of any size taking place when we have reasons to believe the money is being derived from unlawful or illegal activity. There is a statutory obligation on all Totipay employees and their agents to report suspicious transactions to the UK authorities. Where any such report is made, Totipay accepts no liability for any delay in transmission of or confiscation of the funds. The Rates are subject to change in accordance with current national rates. Please enquire to get more details
ar: يمكنك الاتصال بنا على info@totipay.com أو عن طريق عنوان مكتبنا المسجل هو 14 Charles Walk، Rowley Regis، England، B65 9ED والمكتب الرئيسي في TotiPay Ltd، Office 513، 5th Floor، Quayside Tower، Broad Street، Birmingham B1 2HF أنت تعني مستخدم موقع الويب الذي تديره Totipay. يتم تشغيل هذا الموقع (www.totipay.com) وتملكه Totipay برقم تسجيل الشركة ؛ 10338529 (المشار إليها فيما بعد باسم Totipay). مراسلتنا عبر البريد الإلكتروني. يتم توفير استخدام موقع Totipay والوصول إليه على أساس الشروط والأحكام التالية: 1. التغييرات في الموقع 1.1 قد تقوم Totipay من وقت لآخر بإجراء مثل هذه التغييرات على محتوى الموقع الإلكتروني أو المنتجات والخدمات التي يقدمها. 1.2 يجوز لشركة Totipay سحب مثل هذه الخدمات والمنتجات حسب الاقتضاء. 1.3 يجوز لـ Totipay إنهاء وصولك أو استخدامك للموقع إذا كان هناك أي خرق لشروطنا أو شروطنا أو في حالة خرق القانون أو اللوائح. تحتفظ Totipay بالحق في استخدام إجراءات مختلفة لمصادقة كل معاملة بما في ذلك عمليات التحقق من الهوية. تحتفظ Totipay بالحق في رفض أو التوقف عن معالجة أي جزء من طلبك في أي وقت. 1.4 قد توقف Totipay عن تشغيل الموقع. 2. الوصول المسموح به إلى الموقع 2.1 يجب ألا تستخدم موقع الويب من أي بلد يحظر فيه القانون الوصول إلى الموقع أو استخدامه أو أي من المعلومات أو المنتجات أو الخدمات الموجودة عليه. لا يشكل هذا الموقع الإلكتروني دعوة أو طلبًا من Totipay لأي شخص لاستخدام أي من هذه المعلومات أو المنتجات أو الخدمات في البلدان التي يحظر فيها القانون القيام بذلك. 3. الاعتماد على المعلومات المنشورة 3.1 تستخدم Totipay جهودها المعقولة للتأكد من أن أي معلومات مؤرخة واردة أو مستنسخة على الموقع الإلكتروني محدثة في التاريخ المحدد لنشرها. لا تتحمل Totipay أي مسؤولية لتحديث أو تعديل أي معلومات. قد تكون المعلومات أو المحتوى الذي يوفره الموقع قديمًا في أي وقت محدد. 4. القيود المفروضة على استخدام الموقع 4.1 محتوى الموقع والمنتجات والخدمات التي توفرها Totipay على الموقع مخصصة للاستخدام في العطلات أو بائعو الأعمال أو الأفراد أو الشركات التي تسعى إلى شراء العملات لغرض العمل أو السفر ، ولا ينبغي استخدامها للمضاربة أو الاستثمار. 5. الملكية الفكرية 5.1 جميع حقوق الملكية الفكرية وجميع المواد التي يتألف منها الموقع الإلكتروني أو يحتوي عليها على سبيل المثال لا الحصر ، جميع النصوص / المقالات والشعارات والبرامج والصور مملوكة أو مرخصة ، باستثناء ما هو منصوص عليه صراحةً ، بواسطة Totipay. 5.2 يحق لك الوصول إلى موقع الويب لأغراض الوصول إلى التسهيلات التي تقدمها Totipay. ومع ذلك ، لا يجوز لك استخدام موقع الويب أو محتوياته بأي شكل من الأشكال ، بشكل مباشر أو غير مباشر ، لأي غرض آخر. لا يجوز نسخ المواد الموجودة على الموقع الإلكتروني أو إعادة توزيعها لأغراض تجارية أو للتعويض من أي نوع دون إذن كتابي من Totipay. 6. روابط لمواقع أخرى 6.1 يحتوي هذا الموقع على روابط لمواقع طرف ثالث. يتم توفير هذه الروابط لراحتك. 6.2 لا تتحكم Totipay في منشورات مواقع الطرف الثالث. لا تضمن Totipay محتوى أو دقة مواقع الطرف الثالث ولا تقبل Totipay المسؤولية أو المسؤولية فيما يتعلق بالمحتوى أو المنتجات التي تقدمها هذه المواقع. 7. قيود المسؤولية 7.1 يتم توفير جميع المحتويات المعروضة على الموقع الإلكتروني بما في ذلك الخدمات والمنتجات التي نقدمها دون أي ضمانات أو شروط أو ضمانات تقدمها Totipay. يتم استبعاد جميع هذه الضمانات أو الشروط أو الضمانات التي قد تكون ضمنية بموجب القانون إلى أقصى حد يسمح به القانون. على وجه الخصوص ، لا تضمن Totipay الدقة و / أو الملاءمة والموثوقية والاكتمال والأداء و / أو الملاءمة لغرض محتوى أي خدمات أو منتجات متوفرة على هذا الموقع. 7.2 تستخدم Totipay المهارة والعناية المعقولة في تقديم منتجاتها وخدماتها لك. ومع ذلك (إلى أقصى حد يسمح به القانون) Totipay ليست مسؤولة تجاهك عن أي خسارة أو ضرر أو مطالبة أو تعويض (بما في ذلك خسارة الربح أو خسارة الاستخدام) الناشئة عن: 7.2.1 استخدامك أو تأخيرك أو عدم قدرتك على استخدام هذا الموقع ؛ 7.2.2 أي عدم قدرة على أداء أي من التزامات Totipay بسبب فشل أي أنظمة تقنية أو كمبيوتر ؛ 7.2.3 أي أسباب خارجة عن سيطرة Totipay المعقولة. وسيشمل ذلك (من بين أمور أخرى) الحرب والإرهاب والعمل الحكومي والكوارث الطبيعية والنزاعات الصناعية ؛ 7.2.4 أي ضرر يلحق بأجهزة الكمبيوتر لديك نتيجة استخدام هذا الموقع أو أي منتجات أو خدمات مقدمة منه ؛ 7.2.5 أي تغيير في أسعار العملات الأجنبية قد يحدث من وقت لآخر. 7.3 دون تقييد الاستثناءات العامة للمسؤولية على النحو المنصوص عليه في القسمين 7.1 و 7.2 ، (إلى أقصى حد يسمح به القانون) لا تتحمل Totipay أي مسؤولية تجاهك عن أي خسارة في الربح أو خسارة في الاستخدام أو خسائر غير مباشرة أو تبعية أو مطالبات أو غيرها من الأضرار التي تتكبدها أو تتكبدها من استخدام الموقع أو المنتجات أو الخدمات التي يقدمها. 7.4 الحد الأقصى للمسؤولية الإجمالية التي تتحملها Totipay تجاهك فيما يتعلق بجميع معاملات العملات الأجنبية التي تقوم بها ، ستقتصر على استرداد يعادل أي أموال دفعتها إلى Totipay للحصول على العملات الأجنبية. 7.5 لا تضمن Totipay خلو موقع الويب من الفيروسات أو أي مواد أخرى ضارة أو ضارة تقنيًا. Totipay ليست مسؤولة عن أي فيروسات عن مواد أخرى ضارة من الناحية التكنولوجية قد تؤثر على أجهزة الكمبيوتر أو برامج الكمبيوتر أو المواد الأخرى الناتجة عن استخدامك للموقع. 7.6 لا تنطبق إخلاء المسؤولية وحدود المسؤولية الواردة في هذه الشروط والأحكام على أي أضرار ناجمة عن الوفاة أو الإصابة الشخصية الناجمة عن إهمال Totipay أو أي من موظفيها أو وكلائها أو عن الاحتيال. 7.7 لا تتحمل Totipay أي مسؤولية عن الخسارة الناتجة عن الإنفاق الاحتيالي أو أي استخدام آخر غير مصرح به للخدمة ، ولكنها ستساعد عملائها في إعداد مطالبة لتقديمها إلى الأطراف الخارجية المناسبة حيثما طلب ذلك. 7.8 إذا كانت أي أحكام من هذه الشروط والأحكام بما في ذلك إخلاء المسؤولية والقيود هذه غير قانونية أو غير قابلة للتنفيذ ، فإن هذه الأحكام سوف تسقط ولن تؤثر على صلاحية وإنفاذ الشروط المتبقية. تبقى حقوقك القانونية تتأثر. 8. الخصوصية وحماية البيانات تعالج Totipay المعلومات المتعلقة بك وفقًا لسياسة الخصوصية الخاصة بها. باستخدام موقع الويب ، فإنك توافق على هذه العمليات وتؤكد أن جميع البيانات التي تقدمها دقيقة. القوانين الحاكمة والتغييرات في هذه الشروط والأحكام 9. استخدام الموقع يخضع استخدام الموقع وهذه الشروط والأحكام لقوانين إنجلترا وويلز. 10. المنازعات يتم حل جميع النزاعات الناشئة عن استخدام الموقع الإلكتروني و / أو أي خدمات أو منتجات مقدمة من Totipay أو أي نزاع يتعلق بهذه الشروط والأحكام من قبل محاكم إنجلترا وويلز. 11. الحق في التغيير تحتفظ Totipay بالحق في تغيير هذه الشروط والأحكام من وقت لآخر. يجب عليك التحقق من هذه الشروط والأحكام في كل مرة تستخدم فيها الموقع. باستخدام موقع الويب ، سيتم التعامل مع موافقتك على هذه الشروط والأحكام و / أو أي شروط وأحكام منقحة قد تظهر من وقت لآخر. الأحكام المتعلقة بتقديم الطلب ووقت تكوين العقد بينك وبين Top Connect. 1. يجب تقديم الطلبات من خلال الموقع الإلكتروني فقط من قبل الأفراد الذين تزيد أعمارهم عن 18 عامًا. 2. على موقع الويب ، تتيح Totipay العملة للشراء فيما يتعلق بالعطلات وسفر العمل وما إلى ذلك ، (ولكن ليس للاستثمار أو المضاربة). 3. يرجى اتباع الخطوات التي تظهر على الشاشة لتقديم طلب. تحتفظ Totipay بالحق في طلب مزيد من المعلومات من أجل معالجة طلبك. 4. ستستخدم Totipay إجراءات مختلفة لمصادقة كل معاملة لأغراض القانون واللوائح بما في ذلك لوائح مكافحة غسيل الأموال. تحتفظ Totipay بالحق في رفض أو معالجة أي جزء من طلبك في أي وقت. 5. ستتمكن من تعديل تفاصيل طلبك في أي وقت حتى تضغط على زر الحجز الآن. 6. سترسل لك Totipay إشعارًا بالبريد الإلكتروني باستلام طلبك بمجرد استلامه ، ولكن يرجى ملاحظة أن هذا إقرار فقط ولا يعني قبول Totipay لطلبك. 7. بمجرد تقديم طلبك لتحويل الأموال على موقعنا الإلكتروني أو عبر الهاتف أو عبر زيارة مكتبنا أو فرعنا ، فإنك تفوض Top Connect بمجرد تقديمك لطلب تحويل الأموال على موقعنا الإلكتروني أو عبر الهاتف أو عبر زيارة مكتبنا أو الفرع ، فأنت تفوض Totipay لاتخاذ إجراء بشأن طلبك ، وبالتالي لن يُسمح لك بإلغاء الطلب وفقًا لسياسة الإلغاء المنصوص عليها في الفقرة 8 أدناه. إذا كنت ترغب في إجراء أي تعديلات على طلبك ، فستبذل Totipay مساعيها المعقولة لتلبية احتياجاتك ولكن القرار النهائي يعود إلى تقديرنا الخاص. إذا كنت ترغب في تعديل طلبك ، يرجى إرسال بريد إلكتروني إلى مديرنا على info@totipay.com. ستخضع أي تعديلات من هذا القبيل لأسعار الصرف الأجنبي المعمول بها كما تنشرها Totipay على الموقع من وقت لآخر. إذا وافقت Totipay على تعديل طلبك ، فستتلقى رسالة بريد إلكتروني لتأكيد ذلك. ومع ذلك ، فإن Totipay ليست ملزمة بقبول أي تعديلات من هذا القبيل على طلبك ولا تقبل Totipay أي التزام أو مسؤولية في حال قررت عدم القيام بذلك. 8. يمكنك إلغاء طلبك من خلال تزويد Totipay بإشعار كتابي بالإلغاء ، عبر البريد الإلكتروني إلى info@totipay.com في أقرب فرصة. يرجى ملاحظة أنه بحلول هذا الوقت ، ربما تكون Totipay قد اشترت طلب Cedi الخاص بك بسعر الصرف الأجنبي في ذلك اليوم. في حالة الإلغاء ، سوف تتلقى استردادًا لسعر الصرف الأجنبي السائد في وقت إلغاء الطلب والذي قد يكون مختلفًا عن سعر الصرف الأجنبي في وقت طلبك حيث تتقلب أسعار صرف السيدي والجنيه الإسترليني والدولار الأمريكي . 9. تخضع جميع الطلبات لقبول Totipay وستؤكد Totipay هذا القبول عبر البريد الإلكتروني للإشارة إلى قبول طلبك. سيتم تشكيل العقد بين Totipay وأنت فقط بمجرد أن ترسل لك Totipay رسالة تأكيد عبر البريد الإلكتروني تفيد بقبول طلبك. حتى ذلك الوقت ، لن يكون هناك ترتيب ملزم لشركة Totipay لتزويدك بأي خدمة تحويل أموال أو صرف أجنبي أو خدمات أخرى. يجب عليك طباعة نسخة من رسالة التأكيد الإلكترونية والاحتفاظ بها في سجلاتك أو إيصال الإيصال الذي ستقدمه لك Totipay. 10. Totipay ليست ملزمة بقبول أي طلب وقد ترفض القيام بذلك لأي سبب من الأسباب السعر والتوافر والتسليم 11. سيتم تسليم طلب تحويل الأموال الخاص بك في وقت التعليمات الخاصة بك. 12. سيكون سعر الجنيه الإسترليني المستحق الدفع لـ Cedi الذي ترغب في إرساله كما هو موضح في شاشة التأكيد وسيكون صالحًا فقط لفترة قصيرة من الوقت حيث تتقلب أسعار صرف العملات الأجنبية بانتظام. إذا لم تقدم طلبك فورًا ، فأنت تدخل شاشة التأكيد يتغير السعر كثيرًا وستحتاج إلى دخول الشاشة مرة أخرى لمعرفة السعر المحدث. 13. يحق لـ Totipay مراجعة وتعديل هذه الشروط والأحكام من وقت لآخر. ستخضع للشروط والأحكام المعمول بها في الوقت الذي تقدم فيه طلبك مع Totipay. من خلال تقديم طلب ، فإنك توافق على الشروط والأحكام السارية وقت إصدار الطلب. 14. يحق لـ Totipay رفض أمر تحويل الأموال أو سحبه أو إلغائه في أي وقت ولأي سبب. يجوز لـ Totipay إنهاء أي أمر تحويل أموال في أي وقت. 15. يُرجى العلم بأن بعض الطلبات قد تكون خارجة عن سيطرة Totipay. على هذا النحو ، لا تتحمل Totipay أي مسؤولية عن مثل هذه الإجراءات. إذا كنت تدفع بالبطاقة ، يرجى ملاحظة أن Totipay لا تقوم برد الرسوم التي فرضتها جهة إصدار بطاقتك وأن رسوم الإلغاء المتأخر قد تخضع أيضًا لرسوم السلفة النقدية من جهة إصدار بطاقتك. يجوز لـ Totipay أيضًا إنهاء أي عقد أبرمته معك إذا كان مطلوبًا القيام بذلك بناءً على تعليمات من أي وكالة لإنفاذ القانون أو هيئة تنظيمية. في هذه الحالة ، قد تحتفظ Totipay بكامل أموالك أو أي منها إذا كان ذلك مطلوبًا بموجب القانون ثم تتعامل معها وفقًا لأمر محكمة أو هيئة أخرى مختصة. بصفتها شركة خدمات مالية (MSB) ، تم تسجيل Totipay وتنظيمها بواسطة الجمارك والضرائب HM بموجب لوائح غسيل الأموال ومرخصة من قبل FCA كمؤسسة دفع. موظفونا على دراية تامة بإرشادات مكافحة غسيل الأموال وهم على دراية بمسؤولياتهم في المراقبة والإبلاغ عن أي إجراءات تثير الشكوك أو تثير القلق. تحتفظ Totipay بالحق في إجراء عمليات التحقق من الهوية وفقًا للشروط والأحكام على جميع الأفراد الذين يقدمون طلبًا على الموقع. لمزيد من المعلومات حول عمليات التحقق من الهوية هذه ، يرجى الاتصال info@totipay.com. تحتفظ Totipay بالحق في جميع الأوقات في رفض معالجة أي طلب بالعملة الأجنبية تعتقد وفقًا لتقديرها الخاص أنه مرتبط بأي شكل من الأشكال لغرض غير قانوني أو غير قانوني. لدينا التزام قانوني بإبلاغ الجمارك والضرائب أو NCIS عن أي معاملات مشبوهة من هذا القبيل. Totipay ملزمة بموجب القانون بمراقبة أي معاملات غير عادية أو مشبوهة من أي حجم تحدث عندما تكون لدينا أسباب للاعتقاد بأن الأموال مستمدة من نشاط غير قانوني أو غير قانوني. هناك التزام قانوني على جميع موظفي Totipay ووكلائهم للإبلاغ عن المعاملات المشبوهة إلى سلطات المملكة المتحدة. عند تقديم أي تقرير من هذا القبيل ، لا تتحمل Totipay أي مسؤولية عن أي تأخير في إرسال الأموال أو مصادرتها. الأسعار قابلة للتغيير وفقًا للأسعار الوطنية الحالية. يرجى الاستفسار للحصول على مزيد من التفاصيل
